{
  "https://old.reddit.com/r/Tekken/comments/1795953/prepping_for_tekken_8_anti_bryan_fury_discussion/": [
    "Holy shit what a UNIT of an effortpost.",
    "It's so rare to see a meaningful post with real gameplay advice/tips. Amazing post!.Keep 'em coming!",
    "Thank you. It's actually the abundance of \"What/Who/Why do you think X\" discussion posts that made me want to make this. Hope this starts something as a change.",
    "Typo in the first graph, should be ws/qcf3",
    "ah you're right thanks",
    "I feel like bryan's tracking has reduced and its easier to step b1,3+4 on tekken 8 which is a great change. Still top tier character also on 8.",
    "Yeah, I agree that it's a really good change. The reduced tracking of everything in T8 makes a lot of matchups easier for new players too.",
    "Yep, my gameplay really focused on sidestepping  and reading timings, its so fruatrating when i do ss block to bryans weak side and i block those 2 movea and have 0 reward...also it happens with many other moves,player now will have to think twice before spamming those moves with almost no risk and i love it, i know ill get huge reward for it :)",
    "Wow this is amazing",
    "Thanks",
    "Author Note: This guide assumes that the reader has, at least, a basic understanding of frame data. Most of these things should also be applicable when transferring to Tekken 8. Some of these things may also be too hard for some like reading timings or dash up sidestep or may be too impractical when doing it in game so I tried to provide as many solutions that I can think of that even beginner green ranks can at least take something away from this. If you guys think that there's a mistake on my approaches though, please point them out.",
    "Really nice writeup. I wrote one of these for Asuka way back. I was thinking of going back to it in time for tekken 8. I never updated it for later seasons...I would stress the importance of jab and magic 4 in this matchup. He has nothing but db3 to slip under highs. .He tends to be +4 after most things, so if Bryan auto-pilots into df1, you can magic 4 trade or jab interrupt him. If he tries df2 or jabs to frame trap, SSR block. .In range 1-2 neutral, SSR into block can open up whiff punish opportunities against moves like 3+4 and FF2..Whiff punishment with Bryan is really difficult, you can't do jet upper or qcb2 out of backdash easily. So abuse moves like DF2 and magic 4 at range 1. Most of his attacks are also really bad on whiff. The exception is orbital, but even that can be baited and punished. .He has a lot of key mid-high and low-high strings. Qcb24, d32, b21, df21. If you haven't built up the skill of ducking and launching those strings yet, Bryan is excellent practice. .don't get CH by 121. If he delays it you can SSL. If you think he'll do the low, low parry as it's only -12. If you do that, the mixup is in your favour.",
    "Thank you for the additional info. On point 2 however, I don't think this applies anymore. I can only think of 1,4 on hit and b1 on block that gives him +4f. Hatchet also got buffed now giving +5f instead of +4f on hit so having it trade with a jab isn't in your favor. Any other moves like d2,df2,1,2 on hit are +5 or greater..Also, to add in on the last point, characters that have good backswing blows covers 123, 12 delayed 1, and sometimes 124. Only do this if you have a hard read as you could get CH launched when 121 isn't delayed.",
    "Ah yes, I forgot about that hatchet buff. Really annoying because at +5 you can't step df2,1 either. F3 on hit and ws3 on hit are also +4, but yes, it's not a good general rule to stick to anymore. +5 also allows him to use D2 which tracks and is great on block or hit. .So, to break it down, respect him on hit. Rotate between block and low parry,  challenge only if you think he'll go for a backsway or overextend with b1. When opting to block, lookout and try to duck df21, or guess and interrupt the df1 string to escape.",
    "This is great work! If you haven't already, please consider contributing to Bryan's page on Wavu Wiki. It's like Dustloop but for Tekken",
    "Will do. I actually forgot about wavu wavu thanks for suggesting.",
    "Good read. Thanks.",
    "i'm saving this.",
    "This looks like a pretty great resource, you got more of these coming or are you mostly focused on Bryan?.Also, is there a decent place where I can map inputs to visuals? I mostly browse Armor King related subreddits...",
    "I will make more posts like this of other characters as well but only for characters that I can play and will appear in the Tekken 8 roster. My criteria before making one of these is to at least have them rank up to around blue ranks and have enough experience (something like 100 wins in rank minimum) and confidence take on god ranks as well. As for the visuals, I made them myself.",
    "Glad to hear it!.As for the visuals part I just meant is there a spot where I can quickly see what move corresponds to what input? I've only really played a couple of characters so when people mention character inputs it means nothing to me unless it's something pretty universal (b1, hopkick ect) or well-known (hellsweep, orbital ect). It would be good to know a spot where I can look up the animations and see what means what without having to spam the frame bot or waste peoples' time asking.",
    "Oops, I misunderstood. This is the only one I can find: https://geppopotamus.info/game/tekken7fr/bryan/data_en.htm. Animations are played when the images are clicked..There' also this youtube video as an alternative: https://youtu.be/-QRT_LaLXk0?si=dI_gnFCYY8Af7P_O&t=91.I also realized that I should also record these moves so maybe in the next one I'll add them in.",
    "That's perfect, thanks!",
    "Damn bro let us bryan players get a chance to eat sheesh lol",
    "This is so helpful for someone like me who struggles against Bryan. I appreciate this",
    "Well put together post, a few things to mention that is more important at high level:.Bryan's most underused move by most players outside of the very top players is DB2, this move becomes essentially a homing frame trap at +4 and above, meaning good Bryan's will use this as a tool to stop you from stepping brainlessly..The key thing to note here is that DB2 is -6 on block so he can't step a jab and you are free to apply a i15 and below mid/low 50/50 or take the frames etc..Another thing to mention is that Bryan's D4 is essentially a homing move, and is his best low as it is 0 on hit and only -11, SSR Fuzzy is very good at range 1.5-2 against Bryan because his 3+4 will whiff and you can sometimes catch D4 for a low parry/block punish.",
    "Thank you for the added tips!",
    "Mom this information is too neatly organized, please come get me I'm scared.",
    "Appreciate the veritable effort that went into this post, thank you very much! Looking forward to putting some of what I've read into practise!",
    "Holy shitsnacks! Thank you so much for this, this is just what I needed to take my anti bryan game to the next level",
    "As Bryan main this was great to see. Could you please make posts like that about more characters?",
    "I will. I plan to make as many as I can before t8 releases.",
    "What a fantastic write-up. Thank you for this!",
    "Bookmarked. Great guide. Looking for more.",
    "Thank you. I'll post more in the future.",
    "You're now the only Negan main I respect lol, great job! Would love to see this for more characters",
    "Thank you! I will make more of these in the future. Claudio will be next and maybe Hwoarang or Dragunov after him.",
    "Unbelievable post well done",
    "knowledge is everything",
    "People who create and study guides like this are the absolute reason I hate Tekken these days. Tekken 4 was the last good game because it was before era of adderall popping FGC types creating things like this. This game isn't even out yet.",
    "but taunt was nerfed to the point its not needed...",
    "Disagree. It's still useful for getting guaranteed plus frames and at the wall, taunt b4 still hurts+setup for oki. The 70% scaling was too much though and I think it's fairer to just scale it like a combo (90% scaling).",
    "Bro I got downvoted on my own post for saying exactly this. It's insane how much people overestimate taunt. The 30% dmg nerf is ridiculous... Taunt b4 will always be good, but going for a tju in t8 is basically a waste of time now",
    "I feel like tju got the short end of the stick with the taunt scaling. I can understand them nerfing taunt since an unblockable heat smash would be too much but I don't think many people would complain if tju was the exception.",
    "I feel like tju got the short end of the stick with the taunt scaling...There also aren't many situations to go for it. 3+4, d/f+2,3, and CH Hatchet into d+3+4,2 are the main open-ground Taunt setups and they're all gone in T8. Doesn't really work after a Heat Engager either. It's also much more awkward to use when closing distance because of the WR changes (you can't do a Taunt out of the running state, which is harder to avoid in T8).",
    "\"General Bryan Gameplay\".Is Bryan a general in this game?.Oh, nevermind",
    "Bro any chance you could share a noob guide or have u seen one .. like understanding frames in Tekken and punish for new players?? I got  like 7 dudes in the gym that wanna play TEKKEN 8 on release",
    "Tekken 8 should have a tutorial ready (EDIT: IGN just uploaded a new video on Arcade Quest and from what I can see, Tekken 8 are cooking up some good stuff to teach beginners) but if they want to learn now, I know some stuff you could use. .The sub has a beginner resources section so you could start with that: https://www.reddit.com/r/Tekken/wiki/beginner-resources/.For youtube noob guides..Anakin's Tekken Academy: https://youtube.com/playlist?list=PLU3Rw6txLMApn4WyWKkovQXh0T-RxDhdC&si=S4lQP_4z9FgDU_sh..Probably the best playlist when starting from zero. It doesn't go further in explaining frame data though (I mean, it is complicated)..MassiveZug's Ultimate Beginner Guide - https://youtu.be/K-WhR09Q6TU?si=D8J4OWI8xYrdabRM..Is a good summary of everything but is too information heavy and require a lot of reviewing...Learning Any Character - https://youtu.be/hAGOdJWeCNM?si=oex3jOQLNvPdl9HZ..This is when they already have a good feel of playing Tekken. They would usually ask what moves they should use and this could be a good video as a reference...Applay's Frame Data - https://youtu.be/h4llgLAnPgY?si=fjfEU5LktajNpl47..Frame data should honestly be the last few things a beginner should prioritize in learning. If they do learn this, they will quickly learn frame traps, punishing, and taking turns which will turn them beginners to decent very quickly....For beginners (like people touching the game for the first time), have them learn the tekken notations first and show them how to access the move list. I remember teaching other people too and they often enjoy just practicing the moves they find cool. Some also just like to do combos so the combo recommendation solves that. The most important thing though when having them learn Tekken is to not force them into anything. Don't backseat too much and have them just do what they want. If they enjoy it, people will gradually want to learn more.",
    "Thank you so much brother 🫂, hopefully Tekken 8 at release will have the best tutorial of them all",
    "Delete this 🔫",
    "So informative, well done"
  ]
}