{
  "https://old.reddit.com/r/Futurology/comments/xsxnqv/the_uss_national_renewable_energy_laboratory/": [
    "Nice work, this is super useful for small communities and a good example of how the developed nations can produce ideas to help the developing ones.",
    "Puerto Rico could use this RIGHT NOW.",
    "All the Territories, most islands and rural indigenous areas in Canada could use this as well, all of which are relying on diesel right now with not much of an actual plan to stop.",
    "Not very efficient though. Mechanical losses will be high. .Ok for a drop in as an emergency or temporary solution.",
    "It's not about efficiency; it's about shifting reliance away from major providers. Efficiency wouldn't matter if we had a distributed, renewable power grid.",
    "Oh don't get me wrong. I think micro grid are definitely the way to go. I just this the ‘expensive' electronic controller (as described in the article, not me) is a better fit for long term and efficiency.",
    "It sounds to me like they're suggesting grid-connection management devices (such as an inverter for a solar power installation) should all have a simple ad-hoc mode so that local grids can be patched together when faced with major infrastructure damage. It's not a replacement for organized infrastructure, but a minimalist system that can still load-manage when your infrastructure consists of nothing but extension cords.",
    "I reread the article. I missed that they mentioned a 155k/Mw controller. I was thinking a lot smaller scale when they mentioned micro grid.",
    "These ideas are also meant for the \"developed\" world. Large central fossil feul burning is on the way out. Local wind and solar is the future. The benefits of centralized energy production in terms of economies of scale make less sense in a renewable world.",
    "Step 1: Set up Microgrid..Step 2: Set up micromanufacting on microgrid capable of producing microgrid parts..Step 3: ???.Step 4: Conquer the galaxy.",
    "Dyson sphere isn't the greenest of power sources",
    "I don't understand what you're saying. I know what's a dyson sphere. Could you explain the joke ?",
    "A dyson sphere is essentially putting a solar panel around the sun.",
    "Yeah, I know.",
    "So totally or partially stopping the sunlight from reaching earth would be extremely environmentally unfriendly, or not very green..An interesting scenario that stems from this is that if one wanted to build a dyson sphere while preserving life as we know it on Earth, they would have a few options to pick from. Build a partial sphere, excluding a narrow band on the plane that Earth orbits. Slightly more efficient would be to build a sphere with a porthole window that rotates to keep earth in the spotlight. You could have the whole sphere rotate or the band on the Earth's orbital plane that includes the window.",
    "Make a Dyson sphere around a different star..Or - and hear me out - we could sacrifice billionaires to the ancient ones and use the incredible force of their can-do attitude and sheer gumption to power the Earth.",
    "This is most logical..Such provactive thoughts,.Ahhh yes, .Truly",
    "The important thing is that we're talking about it.",
    "Why not both?",
    "That's the spirit 🙂",
    "You can have empty spots in the swarm that let light trough earth, mirrors could also be used.",
    "They specifically said sphere, not swarm.",
    "Then have an hole/holes and mirrors that redirect the light. A civilisation that builds Dyson spheres could probably light earth with its own Fusion reactors, I can't see how this would be an insurmountable problem.",
    "Why not just build the sphere around the Earth? And maybe Mars? Sure the surface area would become a ridiculous number that doesn't have it's own name, but we wouldn't be relying on an engineered solution to keep Earth from freezing over..Bonus: seemingly limitless habitable area if it's fancy enough to have rock, water, and atmosphere on the inside surface.",
    "Bad time. Let's say your sphere is 2 AU in diameter, enclosing the inner planets (roughly where the Belt is). Sounds good? No! Because now there's a whole surface that has the same albedo as Earth, pointed at Earth. Kiss your diurnal cycle goodbye and kiss radiative nighttime heat transfer goodbye.",
    "This is so bad in so many ways. The point of a Dyson sphere is to capture the radiation of the sun that the earth doesn't get at all.",
    "I meant a sphere centered on the sun, that's big enough to enclose the Earth too..Turns out that's still a bad idea, but you'd capture all the radiation of the sun that didn't hit planets and such.",
    "A Dyson sphere is a sohere around the sun where the living surface is the internal wall of the sphere, there is no need for earth.the huge amount of liveable surface would allow more than trillions to live in a temperate environment and because its encasing the sun the whole energy output is available for harvesting",
    "Don't forget the sunscreen",
    "There have been later fictional variants that had habitable elements, but the original description was just an energy collection device",
    "Is that counting m-brains?",
    "You're assuming the sphere would be solid, composed of solar panels and also inside of Earths orbit. Doesn't have to be any of those.",
    "Or a Dyson swarm operating at earth syncronous orbits? At these scales orbital mechanics is easy, physics are hard..Tho imo a matryoshka brain made from the inner planets would probably be the best option",
    "around a sun, wouldn't have to be ours.",
    "What about a daughter?",
    "It's a game on steam. You are flown to a randomly generated cluster of planets and you must create a dyson sphere on the nearest star.",
    "I believe, in this context, because you'd have to refine and process all the materials in a Dyson sphere---youd still produce emissions that were harmful. More than likely you'd be doing it on some other planet or in space or whatever. But it WOULD make pollution.",
    "We're gonna need a bigger sun.",
    "Von Neumann probe your way to success and conquer.",
    "Step 3 is using the infinite power to to produce whatever we want",
    "Get taxed to the point of disappearing because by manufacturing you're now part of interstate commerce and your economies of scale can't keep up lol.",
    "Or you could just create your own microgrid with solar and batteries.",
    "Join the solar sub. Most are doing exactly that. It might be my first larger size pet project for my home as well.",
    "Yup my dream would be several acres off grid with solar + batteries. In the right area I would consider joining a microgrid with myself and neighbors.",
    "Bite my shiny metal photovoltaics",
    "That's the dream right there.",
    "[deleted]",
    "Would love to see this for HOAs.  Roof top solar with battery backup",
    "HOAs in the future: \"your solar panels aren't putting out enough power, here's a daily fine until your output rises\"",
    "There won't be HOAs in the future. I'm outlawing them when I become a supervillain.",
    "And yet its the most heroic thing i can imagine.",
    "Wouldn't a supervillain make them mandatory?",
    "I'm going to be a beloved supervillain. I will drive the mosquito to extinction, legalize unrestricted sport hunting of spammers, and nuke Redmond.",
    "Or just neighborhoods in general.",
    "[deleted]",
    "Where do you get this 90% efficiency from? I have heard the batteries used for the grid have been tested to produce 1KW for every 3KW stored",
    "[deleted]",
    "Yeah maybe for things like phone batteries. Grid batteries are a whole different beast. A significant amount of KVARs is necessary to run a grid. Batteries don't scale 1:1 when comparing small Lithium batteries to ones that provide power to a grid..In other words, the inverter necessary to store the energy from AC to DC uses power, and the same vice versa for supplying power. I'm not thinking of hydrogen, just the application of batteries on a grid.",
    "Batteries are crazy bad for environment from mining to fabricating",
    "That ship is starting to sail. Advances have shown we can use much more environment friendly materials, and we can recycle many existing batteries. We can take the dirty recycled batteries and use the recovered materials to build cleaner and easier to recycle versions..And to be frank, it's not like all the mining for coal, fracking, oil refining, etc are any more cleaner. If we can invest in 'not perfect' forms of energy storage to transition away from an energy system that is environmentally damaging from start to finish, we can move towards dramatically less damaging energy production. .It's not that we should be okay lithium ion is dirty during production and recycling, it's that we need to weight the pros and cons of staying the course on an environmentally damaging fossil fuel system, or working towards a system that in the LONG RUN will be much cleaner in most aspects.",
    "Maybe a solution needs to be found in the context of cleaner mining? What makes mining so dirty (apart from outputs or side effects of the machines used to mine)?",
    "Mining is only a piece of the puzzle, but it is dirty for all industries, and many industries employ or buy from mines with questionable practices and human rights records. In many cases, the issue is that the materials and thus the mines are in undeveloped countries, or countries that are looking for money over treating their populace properly. Think/research stuff like blood diamonds..What makes these mines dirty is the lack of regulation, so companies are free to run it as dangerously and cheaply as possible at the expense of environmental impacts and human suffering. These mines, usually in countries with questionable to terrible records, are not controlled by the developed countries who need those resources. An example is if America told China to clean up it's mining. China would laugh at America, who has no jurisdiction or path for reprisal, and continue to do as it pleased. There simply is no reasonable way to force a mine in another country to clean up..That's why it is insanely important to research and develop recycling, and to enact incentives for it at the government level. Since we cannot clean up the mining in other countries, and we cannot legally, or reasonably force a company in our own country to source from more expensive but cleaner sources, we need to try a different approach. If you can recover 85% of rare materials from existing batteries/items inside our country, that is 85% less you need to source from the terrible mine in the Congo. The trick is incentivizing companies to use the recycled materials, or to develop processes to make the recycling processes cheaper and that way you can sell the recycled materials for competitive prices. Look up how incentivizing recycling of Lead Acid batteries got us to something like 97% recycle rate.",
    "Is mining for battery material worse than mining for natural gas, oil, etc.?",
    "You'll need to specify what you mean by 'worse'. There is CONSIDERABLY more mining and extraction of fossil fuels across the entire globe, both in developed and undeveloped countries. This leads to considerably more emissions and environmental damage than rare earth materials. There is also all the pipeline leaks, ocean platform leaks, etc to weigh in. .I am also led to believe that rare earth material mining is more polluting on an individual mining/operation scale, but because there is farrrrrr less of these mines in operation, it does considerably less global damage. It does more damage locally than globally. .This is why, depending on which side of the fence you are on, there are ways to twist a discussion to make one side sound so much better than the other. Ultimately, both have negative impacts on environment and in many cases the employees and communities they exist in or near. Recycling can be an answer to try and prevent the impacts of either scenario above. We just need the infrastructure and political willpower to make it happen.",
    "Mining isnt that dirty. I mean you're digging big holes in the ground. But you fill it back up (more complicated than that). It's refining that is dirty. All those toxic pits are from refining, not mining.",
    "All processes involved require energy, which is almost always fossil fuels",
    "Hilarious that people who don't give a single fuck about mining the metals needed for solar panels, sand for construction, or fucking tar sands for oil suddenly care about the environmental impact of batteries..Methinks this is not an honest line of argument for these people",
    "I do give fucks about those things.",
    "How bad, are they worse than uranium from mining to fabrication? are they worse than fracking or oil extraction? are they worse than coal? .perhaps we shall  cut every tree for our heating needs and forget about the CO2  released to the athmosphere",
    "Far worse than both of those when you consider the amounts needed and that doesn't seem like it's gonna change for a while. .You don't need much uranium (of thorium if you wanna be 2022) for the amount of energy you get.",
    "Actually you are wrong as many studies on the environmental footprint of different forms of energy show, on top of it modern batteries are largely recyclable.and thorium in 2022 means nothing because the plants were expected by 2070 ,  i.e India third phase (as in thorium power plants) and i mention india because they were the ones pushing for thorium since they have some of the largest deposits in the world.as it happens phase one wss eventually completed, phase two has been plaged by cost overrums and delays and as per now mostly paralized, at this point has been a renewed push for nuclear generation but if im correct most are conventional so.and no, uranium power plants using thourium blankets and test runs do not count as commercial thorium plants",
    "He's right, guys. Diesel really is the future of energy.",
    "This is the way I always set up my power grids in Minecraft, and it works really well.",
    "So if I'm reading this right, it is using the grids frequency to communicate/regulate the power sources. I read three lengthy articles on this and all have a very vague explanation of how this is done. It would be really interesting to know the frequency varies based on loads. Anyone know more about this than the OP article?",
    "It sounds like the prime frequency of the microgrid is set by a battery system and its inverter.  Everything else uses it as a reference frequency.  When the battery is discharging and needs to be charged, it will lower it's output frequency, as a signal that the other generation sources need to increase production.  If the battery is charging and needs to discharge, it will raise the frequency..Frequency only really matters for three phase prime movers.  Since the micro grid doesn't have any of those, there is no problem with frequency deviating from the nominal frequency by a half a Hz on either side.  Once upon a time, it mattered for clocks, but we use solid state clocks with crystal resonators now.",
    "This is what it sounds to me but also this sounds like the battery is the controller. Is there some natural tendency in the system to increase the frequency when supply is bigger than the load?",
    "Yes, when you have three phase prime movers (whether that is a motor or a generator).  When a generator is over-generating for its load, it will spin faster and frequency will increase.  When it is under-generating it will slow down and frequency will decrease.  Similar for three phase motors, if there is too much power going into the motor, it will spin faster and force the frequency up, and vice versa..If there are no three phase prime movers, then there is no natural tenancy for this.  In the case of the microgrid, it's entirely manufacturers for signaling purposes.",
    "I see so this system is mimicking the system already used in generator and at the same time allows existing diesel generators to also tie into the micro grid",
    "This makes sense. But couldn't the same thing be accomplished via signaling sent at a different frequency? I'm assuming both would require a simular control system, but with the controller needing a simple low power transmitter VS the inverters varying the power frequency.",
    "The advantage here is it basically ties in with existing droop governors, so you don't need specialized signalling at all.  You just need the specialized system driver (the battery system+inverter) that sets the reference frequency.",
    "This is not correct. You may be confusing frequency with voltage.",
    "No, it's not voltage. In an AC system, voltage will be determined more by reactive loads and generation than by real load mismatches.  If your generators are not producing the right amount of VARs to negate the VARs produced by the system, then your voltage will deviate from your intended system voltage.  This is probably not a huge deal on microgrids, since most loads will be unity power factor loads..Now you can get voltage changes from real load mismatches, but usually you'll trip generators from deviating too far from nominal frequency long before that happens. Rotating generators are very sensitive to frequency, they are designed to run at a specific speed (which correlates directly to system frequency) and deviating too far can cause serious problems, so there is protection on them to trip them offline if they deviate too far from nominal.",
    "Oh ok. I understand the AC generator part of things, but I am less sure about how this frequency works on a renewable energy microgrid. Does the variable frequency work in a way with the AC (capacitive/inductive) reactance equation? for say, you need a lower current so in an inductive circuit, higher frequency -> higher reactance -> higher impedance -> lower current.",
    "I don't think it would have much impact at all.  The amount of deviation from nominal frequency is minimal, half a Hz in each direction, which is less than 1%. That's why they are using it for signaling..Most renewables are designed to run their inverters based on a reference frequency from grid mains.  For devices with no regulation capability, there would be no change to how this works.  But devices that have some regulation (battery storage, hydrogen, wind) would have extra modules to interpret that frequency signal just like a droop controller would and vary their output to help balance the system..Plus if you have existing rotating generation with droop control, like microhydro or diesel, they can tie in and still function.",
    "Submission Statement.I wonder if microgrids are due an economic boom? 13% of the world (940 million people) don't have access to mains electricity. These people are poor, but the cost of microgrids can be shared among small communities. If ten households could share the cost of something costing several thousand dollars, something that costs several hundred dollars seems much more doable. Especially if you consider tying the purchase to microfinance initiatives.",
    "It is happening right now, african comunities that didn't have access to energy now they have access to solar energy .I was just watching the other day a little feed produced by a Massai guy living in a remote area in reddit and he did commented on it",
    "Developing countries can often leapfrog technologies.  By the time most of the developing countries in Central and South America needed to really upgrade their telco infrastructure, mobile towers became easier and cheaper to deploy and that became the norm.",
    "Jason Badeaux and the network he is building is working to utilize the blockchain to help decentralize battery storage. Worth looking into especially with the tax incentives coming out of the new green deal",
    "i have yet to see a reason why blockchain needs to be involved in ANY project, let alone this one.  The article states that this is a much simpler and robust system, no block chain needed for this or anything else really.",
    "Need and want are different. .Do we need blockchain for this to operate? No. .Can you do more if you use tokenization and strategic incentivized roll outs to deploy robust infrastructure faster than any other company has ever dreamed? Resounding yes. .It's a novel concept that has been incredibly successful. Having your user base deploy hardware for some kind of token that has a value is a rather interesting concept. Helium and nova labs are excellent examples with other companies also finding incredible success. .The helium network is largest and fastest deployed lora network in the world. While the network has yet to reach its full potential, the idea behind bootstrapping your equipment by incentivized token is proving to be a incredibly successful business model. Whether or not helium will have any actual real world use case is debatable, but the manner in which they roll out the tech is absolutely booming. React Network is one of 100s of new start ups that are adapting that model to deploy infrastructure at alarming rates. .I'm still learning about the React_Network and I'll also remain a skeptic but from what I've learned, that's going to be a boss project that will really up-end the battery storage sector. .Or I could be totally wrong. It's all brand spanking new frontiers and I'm loving learning more about all the incredible people building these integrated technology. .Also, as for blockchain use case, check out Pharmaledger. Pharmaledger is partnered with literally every single mega-pharmaceutical. And the kicker? You can't speculate or make money from their blockchain use case. It's completely de-monitized token based cryptography utilizing blockchain technologies to make QC and logistics more transparent, accountable and efficient while eliminating those little leaflets (which significantly lowers carbon fuel emissions en bulk). The team heralding that project are some of the best people in the sector. .So I take pause when I hear people claim they have yet to see a reason why blockchain needs to be involved in any project. Are you living under a rock?",
    "i guess they need more grist for the mill, just don't spend more money than you can afford.  Hopefully this whole thing blows over soon and we can get back to reality.",
    "Hate to burst your bubble but T-Mobile just partnered with Helium to utilize their cellular network and to boot, nova labs just received series 4 funding. With the move to Solana, the team will be able to focus on use case rather than maintaining the blockchain. .Lots of clear evidence afoot but everyone has their eyes shut.",
    "Literally nothing you said had value. Pay people in fake money to do something they could do for real money? Sign me the fuck up! \\s",
    "I don't know if you are lazy or willfully ignorant but Pharmaledger is using blockchain technology without a monetized coin. So this idea that you are going to use fake money is moot: there is no speculative asset involved in Pharmaledger. .And to boot, Pharmaledger is already working hand in hand with the EU medical regulators and is partnered with:.Bayer.Pfizer .AstraZeneca .Janssen.And about 10 other major pharmaceutical companies. .But yes, blockchain technology must be nothing. Carry on.",
    "Just because their website uses a lot of big words, doesn't mean they're doing anything useful. From what I can gather from their word soup, they're keeping track of prescriptions' serial numbers... Who cares? We already do that perfectly fine.",
    "Yeah this isn't new….university across the country have viable options for micro grid implementations using all kinds of cheap tech like fly wheels in neighborhoods during peak demand…utility companies make money on distribution not generation. You take distribution away they don't make money. Follow the money and you will find out why this will never happen",
    "Pretty sure this is lobbied against by every Republican/special interests group. These energy companies are public companies that care more about their shareholders than the benefit of communities.​.Theres a reason why cities/states have a \"cap\" on energy generation from solar panels (I.E. some dont allow you to oversize your system)",
    "And the utilities will never let Congress make it a reality.",
    "What is congress? Is that something particular to your country?",
    "United States congress gets a lot of money from companies",
    "I think this is how we beat climate change if you ask me. There is no doubt in my mind that we can't undo it, but if we can figure out a way to expedite the expansion of these micro grid, we are effectively doing for energy creation and consumption, what microprocessors did for computation. It's orders of magnitude more responsive and efficient while allowing for a place in the grid to slow in emergency measures such as gas. It's like heating oil… the shits a lifesaver if you are working with a very low-access area.",
    "Pretty sweet looking class on edX about microgrids: Foundations in Microgrids",
    "Just make solar install mandatory and offer incentives to CONSUMERS not companies. .But lobbying will NEVER allow that",
    "It is mandatory on all new home builds in California. One issue with that though is home builders are installing the absolute minimum possible on each home so the homebuyer either needs to add more or pay a true up bill end of every year.",
    "Wait isn't this what Edison wanted to do during the AC/DC fight?",
    "This will be needed for the lack of VARs that solar produces.",
    "This could help to expand the use of microgrids in both developed and developing countries, as they become more accessible and affordable."
  ]
}