{
  "https://old.reddit.com/r/aviation/comments/17yd3zn/777_appreciation_post": [
    "In front of the entire Seafair crowd.",
    "I heard the next thing said (by exec) was; now you know it can do a barrel roll, and now WE know it can, but....let's never do that again...! (in front of customers, at least).",
    "Wild.  I looked it up.  Very chill guy: https://youtu.be/Ra_khhzuFlE?si=4IT-h4YT8VCUYzFU",
    "Legend",
    "Full beans",
    "Hey Jeff",
    "Hi Connie..u/smartastic ur leaking into real life",
    "Sir, this is reddit.",
    "And? I broke my arms and my mum is coming over to clean tonight.",
    "Hey Sasha I thought you were dead? If not, want to give me any tips on…ya know, the fun stuff?",
    "Thank you and HOLY SHITE!!! 🤯",
    "Okay I was already impressed by OP's vid, that was crazy.",
    "Tex Johnston",
    "He ran into Eddie Rickenbacker (fighter ace and CEO of Eastern) at the after party who, legend has it, punched him and said “You son of a bitch! If you'd told me, I'd have gone with you!”",
    "For real, put some respect on his name",
    "I'm so disappointed that a barrel roll hasn't become a tradition at air shows",
    "Probably for the best,the 777 can probably barrel roll but its not worth the risk",
    "It's a 1g maneuver",
    "I know,but even then tbh",
    "No flash no cash.",
    "Exactly what came to mind 😂",
    "BANK ANGLE.BANK ANGLE.BANK ANGLE",
    "Nah, they pressed the \"sport mode\" button and it disabled any waring and assistance, pure hand driving flying!",
    "That's also why the engines downshifted.",
    "V-tech kicked in",
    "The caption must be wrong, it didn't say it was a B777-Si.",
    "AKA Ryanair mode",
    "Activate 757 emulation mode.",
    "A350 GT",
    "✔️",
    "Check.",
    "Was earing the same in my head !!",
    "Ole Betty was working overtime..",
    "Bank angle check!",
    "Terrain terrain..........pull up!",
    "“Check”",
    "“Bank Angle Check”",
    "“Bank angle check”",
    "I get this reference! That 737 in Paro",
    "The guy saying that lives rent free in my head ever since I saw the video 😂",
    "Same, along with the comment that a fellow redditor made, “that's not how that works.”.😂",
    "Same!",
    "Flew home to the Philippines last year with wife and my 2 kids onboard the Philippines PR103 777ER. Unforgettable experience. Never get tired of watching the triple 7 in all its glory but the new triple 7 is on my bucket list of aircraft to fly.",
    "I love planes, and get excited to fly on something new/unusual. .However, I envy someone who can view a long haul flight as ‘unforgettable'. .The actual flying part of flying fucking sucks, after approximately 3.5 hours.",
    "Only once did I enjoy a long haul flight..I had lots of miles on my emirates account, at the time they were flying the A380 double decker. And I exchanged them for business tickets, which for all intents and purposes were basically first class, because actual first class was your own little apartment in the air. .Best flight in my life. I had my own mini bar, fully reclined seat with huge leg room, a little divider to turn it into a booth, greeted by champagne. It was 9 hours, felt like 2. Damn..oh and the “toilet” had an actual shower in it.",
    "My most memorable longhaul flight was Lufthansa FRA to SIN for 13 hours on the Queen of the Skies the 747. Collected miles for years to buy a 140k point ticket first class on that flight and sitting on Seat 1K basically infront of the pilot. I haven't slept a single minute on that flight and was one of the greatest moments of my life I was so happy to finally fly the Queen in such a way. Same with my first A380 flight from Bangkok to Munich also on Lufthansa is a flight I never will forget and absolutely enjoyed every minute of it. This is a sub for plane lovers and probably most of us enjoy every minute on any kind of plane.",
    "They had the A350 for the JFK - MNL route both ways, I was so looking forward to riding a 777ER again :(",
    "Out of the 2 I'd rather fly the A350 if flying economy. 10 across seating in the 777 is horrible",
    "Yeah, I enjoyed our trip last year in the 777ER but i gotta agree with you. After 12 hours in the air, it's not the most comfortable seats and when you finally get to Ninoy Aquino international airport, you can't wait to get off. I've never been fortunate to fly Philippines first class since i have my wife and 2 kids, it would cost me too.much.",
    "Ditch the wife and kids and just take your mistress along and that would cut the cost in half. ;-)",
    "It'd cut the cost of the trip in half, after the trip it'll cost you half.",
    "Lol 😂",
    "I never flew on the A350 but always wanted to. I live in San Diego so we have to drive to LAX to catch flights to the Philippines.",
    "The premium economy seats are pretty clever when it comes to recline, I enjoyed the flights personally. The tray tables are super low since they're coming out of armrest, my only complaint. So you end up holding up your food most of the time to avoid making a mess.",
    "My first day at Boeing, my lead told me: “The 47 and 37 are the jets made by the greats. The 67 and 57 are the jets made to satisfy the market and test new technologies. The 777? That's the engineers airplane and it is the best thing we make. We don't talk about the 87.”.After working on the production line of the 777 during the X LRIP, I can attest it is an amazing bird.",
    "57 is great",
    "Wait what is it about the 87",
    "OOTL: can someone explain the “we don't talk about the 87” bit?",
    "There has been…setbacks. .Google “Boeing 787 problems” and see the ongoing nature of the saga.",
    "It's a shame, because it's probably the most comfy widebody to fly on imo (at least from what I've tried).",
    "M83 - Outro",
    "Thank you",
    "A lot of great songs on that album.",
    "Just listened to it start to finish and love it.  Never knew M83 before and am now hooked.",
    "Nice!.Have you seen the movie “Oblivion” by chance?",
    "I HAVE… and loved it because of the soundtrack and am just now making the connection based on your comment!",
    "Hahaha, nice.  That one scene where he's lowering his wife into the life support pod and music swells, I was like “…this sounds really familiar”",
    "If you can find a copy, the snowboard film ‘ the art of flight' has some spectacular footage and uses a lot of the songs from this album, I think you'd like it",
    "I always play this album when I fly :)",
    "Not the song I'd have chosen lol",
    "How is this thing not stalling?? Can someone explain why there is not a rapid loss in altitude here. Just seems no way for it to generate vertical lift here especially so slow.",
    "Thing is certified to climb out on one engine, and that's with a load of fuel, passengers, and cargo. Won't be loaded as such for an airshow demo. Very light, and with all that thrust available. The plane is already significantly nose up before that turn starts, and level by the time it's completed as the energy bleeds off. Pure power pushing it thru that maneuver… certainly with plenty of airspeed to spare.",
    "Yeah the sheer power of those 777 engines is just nuts",
    "Each engine has the diameter of a 737 fuselage",
    "And the same diameter as the propellors on a Spitfire...   .I do most of my commuting in 737 and still think about this often sitting on board.. esp when seeing a 777 nearby at the same airport....    don't see many Spitfire around these days sadly.",
    "Your mention of climb out on one engine reminded me of this. On a much smaller scale than the 777... but a 757 in the UK climbing out after engine ingests a corvid (a bird the size of our crows or ravens). Climb out continues like nothing really happened...to my eye. https://www.youtube.com/watch?v=9KhZwsYtNDE",
    "Crows and ravens are corvids. It's a taxonomic family. There is not a single bird called a corvid.",
    "Here's the thing. You said a \"jackdaw is a crow.\"  Is it in the same family? Yes. No one's arguing that.  As someone who is a scientist who studies crows, I am telling you, specifically, in science, no one calls jackdaws crows. If you want to be \"specific\" like you said, then you shouldn't either. They're not the same thing.  If you're saying \"crow family\" you're referring to the taxonomic grouping of Corvidae, which includes things from nutcrackers to blue jays to ravens.  So your reasoning for calling a jackdaw a crow is because random people \"call the black ones crows?\" Let's get grackles and blackbirds in there, then, too.  Also, calling someone a human or an ape? It's not one or the other, that's not how taxonomy works. They're both. A jackdaw is a jackdaw and a member of the crow family. But that's not what you said. You said a jackdaw is a crow, which is not true unless you're okay with calling all members of the crow family crows, which means you'd call blue jays, ravens, and other birds crows, too. Which you said you don't.  It's okay to just admit you're wrong, you know?",
    "Oh wow.  I haven't thought of that guy in a long time. He was Reddit royalty until this happened.",
    "Was this Unidan?",
    "yes.  that was the post that led to his downfall.",
    "weirdly relaxing video to watch",
    "Cool to see people calmly doing their job and following their training",
    "It didn't stall because it didn't exceed the critical angle of attack..It didn't lose altitude because it was climbing as it started the turn.  It did lose nearly all of the vertical component of lift, but that didn't last long.  Basically, the plane vertically coasted through the turn..It may look slow in the video, but they were probably doing 200 kts at the entry.",
    "I think for this particular manuver it's down to raw engine power",
    "And keeping pulling on the stick, if you are at such a steep bank angle and not pulling, you're falling on the ground pretty quickly... Though raw power gives you the constant pulling capability.",
    "Big engines, light load, lots of performance to be had.",
    "The LS swapped Miata of the sky.",
    "Probably just so much thrust. That plane can carry tons of pax+cargo while on full fuel load and still have enough power to climb fast. So here the plane is all empty with minimal fuel load, the thrust to weight ratio is probably very very high.",
    "Thrust you trust.",
    "It never entered a state where the angle of attack is particularly high. It's on a mostly parabolic trajectory while it's rolled nearly sideways.",
    "Why would it stall? The angle of attack isn't that high at all. .It doesn't have a rapid loss of altitude because they were climbing when they went into the maneuver…they did have a rapid loss of climb rate, they just rolled back to level before it went negative. Thats why they climbed to start it…if you're level and roll into a bank that steep you will descend. .There is no vertical lift going on at all during the steepest part of the bank…any lift the wing is generating is purely horizontal.",
    "Ummmm, yeah that is a high AOA plus a very steep turn right after takeoff where speeds are presumably fairly slow compared to its top speed. .Further more the wing on the inside of the turn has a slower relative airspeed and higher subject to stall conditions. .There's actually a multitude of reasons this maneuver could have caused a stall. The only reason is that is the it was basically using thrust to generate vertical lift.",
    "I think you're seeing a high pitch/bank angle and assuming it means a high AoA.",
    "There's no component of thrust in the vertical direction by the end of the maneuver. And you're confusing AoA with bank angle (or possibly pitch angle). It's entirely possible (and likely in this case) to be near zero.AoA at 90 degrees bank. You don't want drag in this maneuver, and vertical lift from the wing isn't helping, so there's no reason to pull much into the bank..Edit: this also isn't right after takeoff…this maneuver happens about 2/3 of the way through the routine and is entered in clean config at high speed from a low pass.",
    "I'm guessing this new plane would stall too and not be able to maintain flying at 90 degrees because the engines probably don't provide enough lift for sustained flight without help from the wings. I really don't think this plane powered through anything and the pilot just rolled out before stalling and had enough speed to not lose elevation during the turn. The engines of today aren't orders of magnitude more powerful than 20 years ago to allow this plane to fly without wing lift, even though the video kind of looks like it and we're used to seeing planes that go past 90 degrees crash lol. I'd love to be proven wrong though and maybe they generate enough thrust to not need wing lift but I seriously doubt it..Structurally it would be crazy hard on a airliner to fly on it's side too because so much weight would be transferred to that bottom wing without any lift so I bet the designers hated watching this lol.",
    "In addition to what others have pointed out, which is that the plane almost certainly didn't stall, it's worth noting that stalling itself doesn't imply an immediate loss of all lift.",
    "Well they do sorta stall. They firewall the throttles, pull up, get a positive stable climb and then yank it over, the lift is lost in the bank and they stop climbing, roll wings level and cruise away. Very cool and impressive!",
    "Ain't no computer flying that! That's all pilot",
    "I hate that every video has to have stupid music over it now.",
    "Tiktokers why everything has to have music to keep their attention. The song subconsciously tells them how soon the main part of the video is.",
    "Turn the music off plz. I want to hear the jet",
    "I wanna hear the crowd yell \"Holy shit!\", at least that's what I said.",
    "You're in dubai bro......you're gonna be hearing Allahu akbar!",
    "Bank angle....Bank angle....TERRAIN TERRAIN PULL UP!.Bank angle....",
    "Can't do that in an Airbus.*In Normal Law (before I get 500 dowmvotes)",
    "It would shout retard at you probably",
    "The no fun manufacturer",
    "Why?",
    "It has built in alpha and roll limits if most of the sensors are working properly.",
    "What's alpha?",
    "Angle of attack",
    "Wikibot isn't wrong, but in this instance it specifically stands for angle of attack.",
    "Angle of attack",
    "Alpha  (uppercase Α, lowercase α; Ancient Greek: ἄλφα, álpha, or Greek: άλφα, romanized: álfa) is the first letter of the Greek alphabet. In the system of Greek numerals, it has a value of one..More details here: https://en.wikipedia.org/wiki/Alpha .This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!.opt out | delete | report/suggest | GitHub",
    "Context matters.",
    "wab delete",
    "your wrist will get bruised first",
    "Stall! stall! crickets.... stall! stall!",
    "Now that‘s just a load of crap",
    "Well, it's not… unless a sensor fails and the plane goes into alt law which is what happened to AF447….",
    "Fucker edited their comment",
    "Holy shit dude :o",
    "It's my favorite widebody. It's a completely arbitrary decision on my part but it still stands.",
    "Ever since I saw that B-52 crash from 1994, I hate to see such stunts.",
    "One: this guy was higher. Two: 777 has a significantly higher thrust to weight ratio, in spite of the B-52 having 8 engines.",
    "C-17, Tail 0173 in Alaska they screwd this up",
    "This is a much more performant aircraft being piloted by a test pilot, not a egomaniac flyboy with a death wish. This is a substantially safer manoeuvre than the B-52 crash.",
    "It's a matter of pilot's decision-making",
    "I could be wrong, but I think it would have been in the news if this were against regs. This looks it was planned, practiced, and done with enough airspeed and altitude. The pilot of the B-52 that crashed was a serial offender who often broke safety rules.",
    "against regs...Dubai has such a thing as regs?.I doubt it unless its about regulating alcohol or women",
    "I know that some things are different in Dubai, but I'm pretty sure that livery means the aircraft is owned and operated by Boeing. They may adjust some things depending on what country they are operating in, but Boeing is going to have procedures that they follow worldwide, especially with regards to safety.",
    "overriding bank limits like mad",
    "I just got hired to help build these! I don't start for a month and the wait is killing me, excited doesn't even begin to describe how I feel.",
    "Always hits me how big they are when you see them doing this kinda thing",
    "Sokka-Haiku by JC_2706:.Always hits me how.Big they are when you see them.Doing this kinda thing..Remember that one time Sokka accidentally used an extra syllable in that Haiku Battle in Ba Sing Se? That was a Sokka Haiku and you just made one.",
    "Bank angle bank angle bank angle",
    "Seems to me that pilot is a Navy person.",
    "Boeing F/A-777",
    "No thank you.",
    "Show me a barrel roll, like the B707.",
    "Not to nitpick (as the bank angle is certainly steep), but this is not a steep turn as much as it is a wifferdill. The main difference is g-loading — holding altitude at that bank would require serious wing loading, whereas the wifferdill can be done entirely at one g. This is what makes it so different from, say, the Fairchild B-52 crash or the Alaska C-17 crash.",
    "looks like a pretty standard closed pull-up. Plane is just slightly larger.",
    "Boeing does much of their testing at my local airport. I see this quite often.",
    "Who sang that song Bythaway ?",
    "M83.  Song is called Outro.",
    "Merci beaucoup monsieu.",
    "Advertising ruined that album, so overplayed lol",
    "read somewhere that modern jet engine has more thrust than the rocket engine that went to the moon, before any rocket physicist gets hysterical, that article states that it is pound per pound (engine weight) comparision, peace ✌️.edit: hence this maneuvre was relatively easier to perform by 777 than that b52 crash",
    "Hmm. I wonder how this comparison works out....GE9X weighs 9.6 tons and produces 489.3 kN of thrust, so a 5.2 thrust/weight ratio..F-1 (first stage engine of Saturn V) weighs 8.4 tons and produces 6,770 kN at sea level, or a 94.1 thrust-weight ratio..Maybe its comparing vehicle takeoff...?.Saturn V liftoff TWR is about 1.15.Boeing 777x is at best 170 tons empty, so a .58 TWR at the very best..Not sure which metric the article compared.",
    "thank you for the insightful data, the article i read was years ago, maybe it was a sensationalist article",
    "I highly doubt that, the Saturn rocket was a beast.",
    "An engine designed to propel 350 tons of people and cargo around the world at ~40,000ft, day in day out for several decades with as little downtime as possible, with safety and efficiency being the number one priorities, is not going to ever have a higher thrust/weight than a rocket designed to send a vessel into orbit, once, with no real regard for fuel economy or reliability beyond “make it last long enough to get the thing up there”.",
    "Saturn V engines had 1.5 million pounds of thrust EACH son, ur wrong",
    "Rocket physicist here, those comparisons are meaningless. If you just look at the dry weight of the engine a rocket engine have an extreme power to weight ratio compared to a turbofan engine. A rocket engine is basically just the afterburner of a military jet so obviously it is going to be lighter..But if you compare the energy output from the same mass of fuel then rocket engines are terrible. Mostly because they not only have to carry fuel but also oxidizer. Airplanes only need to carry half the propellant of a rocket..In your example a Rocketdyne F-1 engine used on the first stage of the Saturn moon rocket have a dry mass of 8.5 ton, a thrust of 7 MN and burns 800 kg fuel and 1800 kg oxygen every second. While the GE9X weighs about 9.5 ton, a thrust of about 0.5 MN and burns considerably less fuel. There just is no meaningful way to compare them.",
    "not even close.  several orders of magnitude less thrust. .the 777 actually has the most powerful high bypass engines made on it  GE90s that develop 110000lbs force of thrust. .the Saturn V rocket produced 7.5 MILLION lbs of thrust at launch.",
    "Stop it, I can only get so hard...",
    "Meanwhile in Gaza and Ukraine the shit still flies.",
    "Impressibe... now try this with a A380 :D",
    "If the song was live, it's just incredibly epic. The roar of the engines just goes along with the song, what a view.",
    "Is it full of people and luggage?",
    "Imagine what if it had MCAS",
    "Every alarm would be sounding in the cockpit",
    "An airshow C-17 fell out of the sky under exact same circumstances.",
    "That was different. In the C-17 crash, the pilot flying was pulling back hard to maintain altitude. The pull meant that the plane entered an accelerated stall, which severely reduced roll control to the point where they couldn't roll wings back to level. In this video, you can see the nose come up before the roll, then fall back to the horizon as the plane banks. This means the pilot has plenty of time to bank before the plane starts descending again and therefore they don't have to pull back hard to try to hold altitude (which is impossible at 90 deg bank anyway). This gives it a safe margin to the stall, which allows for full roll control to be able to roll wings level when needed..TL:DR, the C-17 crew stalled and lost control. The 777 crew had carefully planned it, did not stall and therefore did not lose control.",
    "\"You´re late\"",
    "\"Bank angle\"",
    "Terrain terrain....pull up!",
    "Bank angle",
    "That's awesome 👍👍👍!!!",
    "No barrel roll, i am unsatisfied",
    "Pilot's out there selling airplanes!",
    "The Great Grand child of the Dash - 80!",
    "Pretty awesome for such a big bird. You'd be surprised what a humble \"little\" 752 (with winglets preferably and either engine config) could do with no load, a good pilot, 2 hrs of fuel, and some broken laws",
    "how safe is this?",
    "mf could win a dogfight with an F-104",
    "Throwing her around like it's a 172, love it👌🏽",
    "Damnnn",
    "Cool now fly it upside down",
    "How did it not stall?",
    "It always blows my mind to see what these planes are really capable of. So cool",
    "That thing went definitely more than 60º bank, i refuse to believe it was just the camera. Any other videos of this?",
    "What song is this??",
    "Song Found!.Outro by M83 (02:29; matched: 100%).Album: The Gambler - Music From The Motion Picture. Released on 2011-10-18.",
    "I just wet myself. I watch all sorts of planes, but I hadn't a clue they could do that. I was thinking how much of a turn and before I could finish that pilot just rips that baby around as graceful as an Orca on the hunt. Just beautiful.",
    "MSFS, my dudes.",
    "I hate to rain on y'all's parade but this is a flight sim. Surprised no one else has said anything yet.",
    "Wowzie!! Like an elephant doing ballet !! So cool",
    "Bank Angle. Checked.",
    "I'm not a pilot but wow ... that thing looks like it's going to stall. Awesome job",
    "What's so special about this? I do this all the time in Microsoft flight sim",
    "Emirates watching and fapping from the top floor of the BK",
    "Oh fuck my iced tea",
    "Bank angle, check!",
    "I was waiting for the stall.",
    "“Bank angle bank angle bank angle”"
  ]
}