{
  "https://old.reddit.com/r/anime/comments/3hzt3r/does_anyone_genuinely_dislike_fullmetal_alchemist/": [
    "I can take or leave FMA:B. I didn't think it was bad in any particular area, but it hardly had me at the edge of my seat..I certainly don't plan to re-watch it anytime soon, if ever.",
    "The subreddit hype did it for me, I mean it was good, and had a lot of characters I liked, but it didn't really hit hard in any specific areas for me.",
    "I really disliked the \"comedy\" in it",
    "Yeah same here, it felt intrusive and just generally unfunny, although I think Arakawa realized since it's less prevalent later on.",
    "You will find that in most anime. A lot need that since of relief, but I get. You're probably looking for very serious type thing and that's cool.",
    "Well to be honest, i like some comedies or animes that have comedy, but i just didnt like it in Fullmetal alchemist brotherhood",
    "You'll find people who don't like anything, no matter how popular or acclaimed it is.",
    "I know, but i'm just wondering in this subreddit page.",
    "I know from personal experience there are people who feel FMA: Brotherhood was too faithful to the manga, and that was a bad thing. Which is odd because usually the complaints are the other way around.",
    "I'm not saying that the Fullmetal Alchemist manga is crap (I never read it) but would you want an anime studio to faithfully adapt an original source material with several problems despite having an interesting premise?.This is similar to the case with the Korean film, Oldboy. The filmmakers thought the Oldboy manga was mediocre so they decided to change it into something much better.",
    "FMA: Brotherhood was too faithful to the manga, and that was a bad thing. Which is odd because usually the complaints are the other way around...I wish people would make their minds up.",
    "Individuals can make up their minds. Groups tend to have too many people to make up one mind.",
    "Groups tend to have too many people to make up one mind...This could have its own thread.",
    "I'm kinda one of those people. The more super-hyped or acclaimed a show is, the less I'll like it. A few of my examples (not including FMA:B) would be JoJo, NHK and AoT. .Conversely, with popular shows when I watched unaware of the popularity or there was a lot of negativity about them, I enjoyed them a lot such as SAO, Mahouka, AgK and Fate/Zero..I'm weird like that. In my mind I can hype things up to a massive extent which creates a huge amount of disappointment even if it's still good.",
    "There are definitely people who don't love FMA and FMA: Brotherhood. There are also plenty of people who liked FMA more than FMA: Brotherhood..That said, FMA: Brotherhood is as universally liked as an anime can seem to get.",
    "From what I've seen so far, Fullmetal Alchemist (2003 I think) was an enjoyable, action-fantasy series. The biggest appeal, to me, is the relationship, interactions, and partnership between Edward and Al so I gradually grew attached to them..For Fullmetal Alchemist Brotherhood, the visual and audio presentation is better but I didn't like how rushed the first several episodes were. From a production standpoint, it somewhat makes sense because Bones already animated that from the 2003 anime adaptation but I wanted to see the first story arcs \"properly recreated.\"",
    "It's weird. The 2003 one padded out the beginning with filler, but Brotherhood would just straight cut chapters out from the beginning of the manga. They both had their problems.",
    "That's a shame. It would be nice if Bones made a third version of FMA with the positives found in FMA 2003 and Brotherhood.",
    "Ya, I think it was supposed  to be that way. That's why people recommend the first one first. The pacing is definitely faster in the beginning  in brotherhood",
    "I am not going to assert anything about the quality of Brotherhood because I only got 12 episodes in, but I hated the short jokes and \"Is Al the Full Metal Alchemist\" jokes so much that I dropped the show.",
    "If I'm not mistaken, the jokes start to die down about 12-15 episodes in, but if you dropped it due to the humour, then I dunno if it's worth you picking up again.",
    "I hear great things about it all the time, so giving it another try has been in the back of my mind for a while, but my opinion of it might already be too solidified to do it anytime soon.",
    "Personally, I'd give it another shot. Maybe go to episode 20ish and see how you get on?",
    "I mean I don't know why you would drop it because of a joke, but do what you want. XD",
    "Its weird. I can't really explain why they got to me in such an extreme way, but every time it would happen it would kill the entire mood of the show for me.",
    "Trust me there are some serious, heart pulling stuff if you look past the \"comedy.\"",
    "I actually have a friend who doesn't like Brotherhood. I have tried to ask him why he thinks that the original is better and the best answer he has given is \"The plot is shit!\". So yeah, I don't know why he doesn't like it :|",
    "I can relate. The original FMA is one of the most impressive plot-wise and setting wise anime I watched during childhood. Then I started reading the manga and found out they started to become super cookie cutter shounen halfway through.",
    "I really liked the original and strongly dislike Brotherhood.",
    "I disliked the terrible comedy and BGM for Brotherhood, that's really it though.",
    "But 2003 has the same comedy.",
    "I never watched the original.",
    "I like FMA03, dislike FMAB.",
    "While I didn't dislike Brotherhood, I wouldn't have finished it without having seen FMA 2003 before and the great openings and endings...Comedy was always the same lame joke..Characters weren't as well developed in Brotherhood. Without 2003 I wouldn't have cared about them especially Al and Ed..Personally I thought the themes explored in 2003 were more interesting and 2003 does not have such a clean happy ending like Brotherhood..It lost a lot of tension after episode 28.",
    "The original is pretty good, nothing special though.",
    "I don't dislike it, but it was really \"eh\" for me and I never got into either.",
    "So in my opinion FMA and FMA: Brotherhood are kind of like a staple or cornstone of anime. The thing about the original vs brotherhood is that the original started out following the manga but got caught up and decided to finish it how they wanted to instead of having fillers. Brotherhood on the other hand was done later once the manga had finished and followed the manga very closely. The beginning had a brief overview of the stuff from the original that followed the manga to avoid too much overlap.",
    "I can't stand the FMA manga, and was never a huge fan of the anime. I don't hate it, but I certainly don't like it.",
    "I started watching anime shows recently, and because FMA: B was so high on various \"Top Anime\" lists, it was the first series I watched, after which I watched the original FMA. I knew nothing about these shows and was not exposed to any spoilers or anime communities before watching them..While I liked Brotherhood more, I can't say I liked either one, though I didn't hate them either. It's funny to me that FMA: B is almost universally recommended for introducing people to anime, since my impressions of it were mostly lukewarm to negative. After watching several other anime shows, it seems my issue with FMA: B is mostly stylistic. Almost every reason I've seen people give for liking it is a reason I didn't like it.",
    "It's all about taste. Taste is a gift and a curse. I myself have never watched it but i get people telling me to either watch it or just forget about the show completely. So yes there are people who hate it.",
    "It's not your thing or you just don't have the time?",
    "Well none really. I just haven't decided i'll watch it yet. I'll get to it eventually i just don't know when :p.",
    "Ya I feel, there some stuff I want to get into, but it's like a commitment",
    "Better villains (the sins were actual villain we can care for).Does not abandon the original theme ( e.g equivalent exchange  ).Themes explored in the original is better and they stuck with it until the end (Brotherhood abandoned them halfway through)..What's not to love about the original?",
    "It has a shit ending, with useless filler to pad out the first half of the show.",
    "you mean like that shit everyone is happy and everything is resolved without significant consequences brotherhood?",
    "I'm not sure why you made the assumption I thought Brotherhood's ending was good, but whatever.",
    "FMA03 I like pretty well, but haven't seen it in a decade. Brotherhood I found to be genuinely Not Very Good..Had Brotherhood been on TV when I was 16 instead of the original, it might very well be different story. But it unfortunately aired at the point in time where I was too old for Battle Shounen, but not wise enough to understand that it just wasn't My Thing anymore.",
    "That's fair."
  ]
}