{
  "https://old.reddit.com/r/technology/comments/jemu1f/this_molten_salt_reactor_is_the_next_big_thing_in/": [
    "[deleted]",
    "And it's still true!",
    "Eh, we're still 40 years of funding away from Fusion, but we're still funding at \"Fusion Never\" levels instead.",
    "It's really not though, fusion is ready within 5 years. Expect multiple different companies reaching 100 million degrees within 2 years.",
    "I hope you're right. I really do.",
    "Molten salt reactors are fission based.  The tech for them is readily available and we'll understood.",
    "It's mostly the engineering details that might need work (e.g., corrosion-resistant alloys that can stand up to the molten salts for decades without failing). I believe things have improved on that particular front since the concept was first developed.",
    "[deleted]",
    "yeah no. It's called a drain tank. It's a second tank around the first. filled with more than enough neutron poison to prevent a chain reaction outside the reactor..If your core leaks into your draintank you safely shut down the reactor. If your drain tank leaks into the outside world you safely shut down your reactor before a internal leak is created. There are enough sensor invented to measure fuel entering the drain tank and there are enough sensor invented to measure a gas or fluid leaking form a secondary containment.",
    "I am aware of the drain tanks.  I have little faith in their ability to operate effectively in the case of an excursion which can be measured in milliseconds.",
    "i've heard we're just 20 years away from fusion since the 80's.",
    "20 years with optimal funding yeah.",
    "It's the power source of the future, and always will be. Been hearing this since the mid 70s.",
    "Lots of regulatory burdens. Since \"nuclear power\" for 60+ years meant .\"pressurized water with solid uranium oxide fuel\", all the regulations were   written expecting just that. So when trying to get regulatory sign off on using a completely different fuel, completely different moderator, completely different design and completely different safety system, it has been a huge labor. Especially since Bush admin didn't seem to be a fan of nuclear due to proliferation concerns, Obama wasn't a fan of nuclear due to environmental concerns, and only in 2010 was nuclear really allowed to be privately owned/managed (previously they were essentially govt owned and govt contracted entities managed them). .So it has only been in the last ~4 years that the NRC has really started opening up to drastically new designs and trying to update (or write completely new) regulations to match. This, as I understand it from people who work in that regulatory space, is one of the things that the Trump admin has been good on.",
    "Please get this comment to the top. Magical energy solutions like molten salt reactors and fusion reactors aren't being “buried” by men smoking cigars on fifth avenue. They are heavily regulated areas that require a ton of resources to invest in which most politicians haven't been willing to invest in. They are difficult for a reason. If it wasn't hard Europe or China would have built them already.",
    "China already has/is.",
    "China also has much lower concerns regarding safety.",
    "The NRC doesn't like change so it takes a long time to do anything.  They like stuff to be proven. Doesn't Europe re-enrich their fuel and use it again? I was told (haven't researched it) that it's not approved in the US.",
    "The US stops re-enriching uranium just before the point where it could be used to create nuclear weapons.  Europe re-enriches fuel well past that point.  .It's a tradeoff either way.  If you use enriched uranium in civilian reactors you're more efficient, but also run the risk of theft of weapons grade uranium.",
    "US light water reactors use fuel enriched to about 3% U-235. Weapons grade Uranium is closer to 95% U-235. The reason we don't enrich further isn't due to proliferation concerns, it's because enrichment is very expensive and 3% enrichment is sufficient to run reactors on a standard 18 month fuel lifecycle which is a good maintenance schedule as well. I think that scubba-steve is referring to the fact that the UK reprocesses spent fuel to extract and re-use fissile Plutonium. The Carter administration put a moratorium on nuclear fuel reprocessing due to the fact that the end product was weapons grade Plutonium. The Reagan administration lifted that moratorium, but by then reprocessing wasn't economically viable. Modern pyrochemical techniques allow you to extract all of the transactinides together, without generating any weapons grade materials, that could then be used in existing reactors. This has the same benefit as molten salt reactors in that the resulting waste needs to be contained for hundreds rather than thousands of years, but still the economics and politics don't work out",
    "The biggest problem with that is how expensive that process is. Better to use an MSR where you get ~>95% fuel utilization compared to conventional solid fuel which gets ~<5% fuel utilization.",
    "It took me a while when I was younger, but eventually I realized that “nuclear power” meant “we boil water by blasting atoms”. .That just seemed incredibly inefficient to me for some reason.",
    "I agree. When I was like 12, I remember finding some \"How Stuff Works\" type book and coming across the nuclear power section. I was excited to learn exactly how we draw power from the atom. To learn that it's essentially just a really complicated fire - heating water to create steam to turn a turbine - was a bit of a letdown..Though it's a bit underwhelming, it's not THAT horribly inefficient in how it takes heat and converts to electricity. However, current incarnations are even worse than you may think. .Current nuclear (almost universally) uses solid uranium oxide pellets in long rods. As the neutron reactions take place, the uranium changes to other fission products, including gases. With the assistance of thermal expansion, these gasses expand and crack and break the pellets - often creating a large void in the middle of the pellets. This inhibits both the heat transfer and the continued neutron reaction. The result is that the fuel rods are considered \"spent\" and must be replaced after converting something like 2-5% of the overall uranium in the material..This is one of the potentially HUGE advantages of fluid fuel reactors like MSRs - they can mix the fuel into the liquid, process out the fission products, and completely (or nearly completely) burn the entirety of the radioactive fuel (whether uranium or thorium - or plutonium, depending on design). So instead of solid fuel, where getting a couple of % utilization out of the fuel and ~94% uranium still remaining - but with enough \"impurities\" that fission reaction becomes unsustainable, MSRs focus on liquid fuel where you can mix the radioactive material throughout the fluid, and burn through it almost completely, leaving less than a few % of the original fuel. It's virtually the exact inverse more efficient than solid fuel. 5% usage and 95% waste to 95% usage and 5% waste (obviously that's a bit of an approximation). Plus, depending on the type of salt you use, they can be an even BETTER heat transfer medium per unit volume than water. .Combine all that with being able to eliminate a lot of the engineered safety of current pressurized water designs (the pressure and decay heat being the fundamental problem that has caused all 3 major nuclear disasters - Three Mile Island, Chernobyl, and Fukushima), and there are just a ton of advantages for the Molten Salt approach over conventional nuclear.",
    "That sounds really interesting! I had heard good words about thorium recently, (I think it was thorium) but it was for something besides this molten salt, so that makes me even more hopeful in regards to the future.",
    "Yeah, Thorium has been proposed as a perfect fuel for MSRs. I'm curious what other applications you were seeing..I've seen some people looking at replacing the uranium solid fuel with thorium solid fuel, but it's honestly not much of an advantage there. The liquid fuel is really where it shines. That's why when people like Thomas Massie or Al Franken in Congressional hearings about nuclear, asked specifically about Thorium, the guy responding essentially said that he's heard about people looking at thorium fuel, but could see no real advantage to it. He was talking about as a solid fuel replacement.",
    "Nope nuclear, coal and natural gas plants all produce power the same way. Using super hot steam to spin a turbine. The only difference is the method of heating the water, and probably how hot the steam gets.",
    "Yeah. It just seemed like a really complicated way of boiling water, considering how scientifically advanced the fuel was it confused me when I figured it out. I've come to terms with it since though. .I said this in another comment, but my original thoughts were that the radiation was used to somehow generation electricity directly, and the water was just for cooling.",
    "“My original thoughts were that radiation was used to somehow generate electricity directly”.Just so you know, that is totally a thing too! Just not on the scale of a large power plant. Satellites going out past Mars need to use Radioisotope Thermoelectric Generators (RTGs) to generate power. They use thermoelectric material, which produces electrical power from heat through the Seebeck effect. Wrap that around a block of plutonium-238 and you've got a battery that'll last for decades.",
    "I think that's why I thought that way. I vaguely recall reading about something like that, then reading about nuclear power tech in scifi stories. Most of it was obviously fake, or “future” tech, but I figured we could basically use nuclear fuel as a direct battery. I even remember reading Artemis Fowl and how all the tech underground was nuclear based, up to and including someone's watch. .So when I later found out the reality of “fuel + water = steam turbine” I was reasonably put out xD",
    "I've had the same thought when went into that in some low level engineering class. It's kinda disappointing to find out how much of power is really just ‘we spin this wheel here and it creates the electricity which spins this wheel waaaay over there or heats up this thing waaaay over there'. Gas, nuclear, wind, hydro. Cars, lightbulbs, HVAC, power tools. Besides computers, that's basically all it is. It's like how peaking behind the curtain can ruin the ‘magic' of a show. .But then it's also kinda amazing how much we can do with such simple concepts. With just a few spinning wheels and heat we can make huge manufacturing plants and 3D printers. It annoys me when people claim that pyramids had to have been made by “Aliens” because it severely underestimates the ingenuity and capability of humans with simple tools.",
    "Yeah, I agree. Really really impressive what we've done with it! Not quite matching up to the mystique and half knowledgeable fantasies, but all the more cool once you understand the real world limitations of the technology and why things have to be the way they are.",
    "Those still use heat..There are also betavoltaics which get electricity directly from the radiation.  Of course, with a power output measured in microwatts, you won't be powering a town with them.",
    "You can google image pwr reactor designs and see for yourself. It's actually a very efficient method of producing steam, because water is such a good mediator for nuclear mechanics.",
    "[deleted]",
    "I get that now, but I always thought it was something based off of the actual radiation of energy that transformed that directly into electricity.",
    "something based off of the actual radiation of energy that transformed that directly into electricity..Like an RTG?",
    "Yup. Didn't know the name for it though.",
    "I thought molten salt was the basis for thorium reactors, when are we getting those?",
    "Those are a specific type of molten salt reactor.",
    "Molten salt of course have many benefits. However, if we think about climate change for example the difference between traditional nuclear and molten salt is limited. I think any type of nuclear reactor be it small modular nuclear reactor (SMR), Chinese Bebble reactor or traditional nuclear reactor it is good for this planet. Obviously there and better and worse options, but the fact is that we are building so little nuclear still compared to 80's. There are many reactors being decommissioned in next 10-20 years.",
    "Except cost - which could mean the difference between producing hundreds of reactors a year at $10million/each vs 1 reactor in 10 years costing $10billion.",
    "What brings down the cost? Of course you wouldn't need similar pressure vessel. Is there something else?",
    "You dont need a similar pressure vessel for molten salt since you dont need to pressurize it at all since once you get it to melt around 350-400C, it has about 1000C of liquid range. This means that not only do you not need a pressure vessel, but you can easily go up to 700-800C safely which is much more efficient for generating power than ~300C..In addition, since you dont need the pressure, you dont need the enormous 9\" thick pipings and other fittings - some of which must be custom made - in order to safely maintain such pressure..Finally, using a liquid fuel approach means that in an emergency, you can simply pull the plug on the thing and drain it into tanks designed to halt reactivity and eliminate decay heat. This replaces all the complicated, expensive redundant engineered safety systems with a safe, passive system that works even if all power is lost..Companies like ThorCon believe that by manufacturing power plants like cargo ships, they can assembly line the process and get costs per MW down to the same cost as coal.",
    "Yes. So similar benefits as SMR. However if you do produce electricity you would still need pressure for turbines? Of course these are much easier to handle. However I don't think the transfer from molten salt to water (if you plan using turbines for electricity) comes without risks as molten salt + water is potentially explosive combination in failure case. All I'm saying is that I'm all for molten salt reactor development, but personally advancing any of the 'nuclear concepts' would be great and I hope they are all successful. I just don't believe molten salt reactors are necessary to be waited. Deploy more  nuclear now, deploy molten salt as well.",
    "CO2 or helium can drive a turbine just fine with higher efficiency and being pretty much inert gasses while in contact with hot salt. CO2 and Helium have already proven themselves in pebble bed and gas cooled reactors.",
    "That's cool. I hope the technology advances fast",
    "Ideally because of the high heat they can use the more efficient Brayton Cycle for power generation so no steam at all need be used, further increasing safety.",
    "ThorCon still uses conventional steam turbines. Who is developing Brayton cycle for this use?",
    "As more expertise in this area develops that is the goal because the temperatures are so much hotter in an LFTR (1000o C) than a PWR. (~ 350o C)  That makes a huge difference in the efficiency of the cycle. See in the above article the section on Methods to Improve  efficiency.",
    "So similar benefits as SMR..Again, except most SMRs appear to be mostly solid fuel, which has a huge efficiency disadvantage to liquid fuels. ..However if you do produce electricity you would still need pressure for turbines?..Yes, but the pressure is created in the steam generator. Not in the core itself. ..I don't think the transfer from molten salt to water (if you plan using turbines for electricity) comes without risks as molten salt + water is potentially explosive combination in failure case. ..But just like with traditional PWRs, the radioactive salt is separated and isolated from the steam generator by the heat exchangers (usually at least one loop between)..I am fine with the rest of your post. The more nuclear, even traditional PWRs, the better. But I do think that preferential investment in MSRs would be a good next step in the evolution in nuclear. Imagine if airplanes in the 1980s were all still using gasoline engine driving twin propellers like in Kitty Hawk - just with bigger engines and more propellers. That's effectively the equivalent for PWRs. They're effectively the same technology that the original reactors created in 1940s used - just at larger scales and more sophisticated safety and control systems. We need a leap in technology like the jet turbine was to airplanes. I believe that's MSRs..Fusion may come along in another 50 years and begin to supplant all fission - though I suspect for at least another 50 years after that, fusion power plants will still require massive facilities and cost billions of dollars per site while MSRs can be cheaper and more quickly deployed to places.",
    "Current technology is over 50 years old and not \"sustainable\". Dumping used fuel is still an unsolved problem.",
    "I guess that is true for used coal (CO2), used solar panels and used wind turbine blades. At least in Finland we have long term storage beneath 400 m underground. I personally think even the waste from molten salt reactors would be contained in similar structures. At least for traditional nuclear produces few tons of difficult waste, molten salt few hundred kilograms. Is the difference that big? Of course it's improvement, I'm just wondering about the significance.",
    "Depleted nuclear fuel will be radioactive for thousands of years, so the storages will be full in a forseeable time..Why are you talking about used coal (lol what?), solar panels and wind turbines? Those things can be recycled, dismantled and the raw material reused. Depleted nuclear waste is just dangerous life threatening waste.",
    "CO2 is also dangerous waste. There are no methods in commercial scale to recycle Solarpanels or blades of wind power blades. Actually the amount of waste generated in nuclear waste is not so large. Here you can see all nuclear waste generated in 45 years in Switzerland. picture",
    "45 years in a tiny country that has a lot of other energy sources (water power) as well. Now try 300 years worldwide in a ever growing population with a inreasing demand for electricity. .If we can find a better solution than just dumping the waste, it will be much more attractive.",
    "Yeah, it's good there are many solutions, but even for whole USA the amount is not that much per year.",
    "[deleted]",
    "or lobbied against by everyone who stands to lose money because of them..Perhaps a barrel of nuclear waste dropped off at their favorite golf club can change their mind.",
    "Unfortunately, most of them equate nuclear waste in general with nuclear power in general. There are millions that listen to people like Helen Caldicott shriek about nuclear like they're all operated literally like in the Simpsons.",
    "You think anti nuclear activists are wealthy golf club owners. That's adorable..Edit: downvote me all you want middle class environmental activists have been trying to close the last nuclear plant in California for decades. .https://en.m.wikipedia.org/wiki/Diablo_Canyon_Power_Plant",
    "oil magnates funding the worse part of them are",
    "The biggest activists fighting nuclear energy are middle class environmental activists. The same ones who have been fighting to close the last plant in California for decades..https://en.m.wikipedia.org/wiki/Diablo_Canyon_Power_Plant",
    "Why'd they build a nuclear power plant on a fault line?..",
    "Because California is covered by faults and one of numerous surveys they did said it had a 1 in 23,000 chance of failure.",
    "I fully expected to open up the link to see it's an article from the early 2000's.",
    "“These fission products generally decay to background levels in about 300 years, as opposed to over 10,000 years for conventional solid-fuel reactors waste,” ..Faster decay generally means the waste is more radioactive right? I'd like to know if it's more or less difficult to handle the waste for those 300 years.",
    "Once you get to sub 25,000 year time lines, the difficulty isn't much different.  Thicker containment, or more dilution.  But I can see designing a storage facility for 300 years, where designing one for 25,000 years is daunting.",
    "I'm guessing that that practically speaking the challenge will be roughly the same. Like, ok, you can't prove it'll last 10'000.. but the failure scenarios are ridiculously hypocritical anyway. And you can always imagine that it'll be relatively easy for humans to dig up and neutralize the waste in 1000 years or whatever. .So I'm guessing the facilities that people will demand for 300year storage will be much the same: dig it far underground in a geologically stable region and hope for the best",
    "Depends on how hot the waste is, if the device is more efficient it will use more energy during the fuels lifespan and shit out less potent waste",
    "More radiation emitted while it's decaying, yes, but still not too difficult to shield. After all the reactor core has far more radiation flying around, and we can shield that just fine. The reduction in timespan is the big benefit. The quantity of waste that must be shielded and stored is also far smaller. .Also note that any fission reactor that's a fast breeder reactor with reprocessing gets this particular benefit, even solid-fuel reactors.",
    "No faster decay would make waste easier as most the radiation would be gone.",
    "That's a contradiction. Decay causes radiation. The only thing you can say based on the article is the radiation is mostly gone after 300 years. What happens before that depends on the waste and how much there is of it. .A lot of elements that we don't consider radioactive just have a very, very long half life. So generally it's a shorter half life we should be concerned about, as those are more radioactive.",
    "But the wase at the end would be less radioactive.",
    "the radiation is mostly gone after 300 years..That sounds like something we could use for RTG-powered probes to the outer Solar System and (locally) beyond!",
    "Hasn't it been the next big thing in nuclear since the 1960's?",
    "Pretty much. I read articles about it in the 90s. It was just around the corner, like fusion reactors.",
    "Seems like Small Nuclear Reactors are the next thing to actually go into commercial production: https://www.energy.gov/ne/nuclear-reactor-technologies/small-modular-nuclear-reactors",
    "ZZzzzzzzzzzzzzzZZZZZZZZZZZzzzzzzzzZZZZZZZZZZZz wake me up, if and when.... I need a good 50yr long nap.",
    "There's a spot next to Walt Disney, I'm sure.",
    "Looks like the machine straight outta DARK",
    "this is just lazy on the part of Popular Mechanics. That reactor is from General fusion and it's an experimental fusion reactor. It has nothing to do with the article aside from the fact it has to do with nuclear power.",
    "Is that why they put iodine in it?",
    "Well_im_waiting.2014",
    "They've been talking about using Thorium for years now. It never really materialized.",
    "When my dad was in high school,  he graduated in 1959, in science class they learned about the amazing new vistas of possibility in the realm of atomic power...the teacher said electricity would be so cheap that the power company wouldn't bother sending out bills for it",
    "\"Too cheap to meter!\"",
    "It's not even new tech. It's old. It just gotta passed over for reactors with the nice side effect of creating material for nuclear bombs. .The biggest plus is that it's self-limiting. No Chernobyl, No Fukushima outcomes. And America has enough Thorium to run for a long, long time. No dependency on foreign suppliers. .No, it's not perfect and there will need to be development of the technology, but we're the country that went to the Moon, we can figure this out, like, easy.",
    "There are a few places using molten salt with solar generating technology I believe. Seems like a logical jump to add nuclear",
    "Thanks for the laugh guys. Solar has already won. Once battery tech is on par with the ability to generate power, this tech will be permanently mothballed.",
    "I am a big fan of solar, plus I also have invisted in renawables, am mod of /r/greeninvestor, so I get you. but nuclear is without a shred of doubt better than its image and inevitable in the fight against climate change",
    "Have you ever discussed the production of carbon neutral fuels like dimethyl-ether being synthesised from the very air if energy was not an issue? That alone seems like a fundamental way to reduce carbon emissions to zero. And using waste heat from reactors to desalinate water and irrigate deserts to grow trees?.The things you can do with limitless energy is just mind-blowing.",
    "Once battery tech is on par with the ability to generate powe..Therein lies the nub of it. First these advanced battery technologies require rare earth materials and well refined ones. This inherently limits the capacity for production and that is without taking into  account solar panel manufacture..Batteries are a necessary component to renewable energy production because their fundamental nature is that of inconsistency. The sun doesn't shine all the time and the wind doesn't blow all the time. .Add that to the fact that the strongest sun and the windiest winds are always far from population centres and so incur up to 20% losses in power transmission you can see how a small safe reactor with no risk of meltdown or explosions , running and normal atmospheric pressure and can be placed anywhere because it has no need for water and you can see the appeal of MSRs and smaller reactors that can run 24/7/365 giving energy on demand.",
    "You assume new pv substrates or battery tech is limited only to current tech. We are closer to pv and storage than costly and dangerous nuclear. In fact will predict it is achieved in the next 10 years. If AI goes as anticipated,  it may assist in the search in the same time frame.",
    "You assume new pv substrates or battery tech is limited only to current tech...I don't think you grok my point. Does not matter how cheap or how clean solar or wind can be, they are fundamentally intermittent  sources. You just can't get away from that. .Not to mention the physical space they may take up even if you stick wind turbines out at sea you still have the problems of power transmission and that is not a solvable problem. .So while solar etc are good for the conscience they are still not an panacea and never will be. Small, safe nuclear on the other hand could be revolutionary as they can be built close to population centres or anywhere really. In the middle of the desert, at the polar ice caps.. under the sea.. Fission works anywhere , even in the emptiness of space. .Thorium is everywhere too. In the physical earth we stand on, in the sea and on the moon or any comets and asteroids that pass by. .Once we learn to harness that we will never run out of it ever.",
    "I disagree. As someone that has two houses both with 8.0kwh solar arrays, can confirm that battery tech is a game changer. My main house has chemical marine batteries. The life is 5-8 without maintenance. The mountain house will use a Sonnen lithium iron phosphate battery. That storage is awesome. 20 kWh storage at 48v, 2-3 recharge using array. Drain can go all the way 30 with zero damage. So essentially I am off grid but stay attached to provide credit for any intermittent use. .I hear what you are saying, but that molten salt thorium reactor is only a few years off. (Rofl) while I cook, heat and cool with solar.",
    "You powering your log cabin in the woods is not the problem. It is everyone else who mainly live in cities who stand to benefit. Or is going green now an attitude of \"I'm alright Jack' ?.If you are willing to make compromises you can can easily be self sufficient but for that you need space and time and money. 3 things a working population in inner cities don't have.",
    "Grid scale solar is even better, and can be balanced by wind and hydro which can be quickly ramped down during peak daylight by braking select turbines (which prolongs their lifespan) or reducing the water through the turbines, leaving more available for irrigation. .Nuclear is moving forward, no two ways about it, but it's slow and expensive and solar is still enjoying its S curve.",
    "Its always something else. Pro nuke people are like watermelon seeds. What part of selling excess back to the grid do you not understand. Also my “log cabin in the woods” is 2200 sq with zero logs in it. .Large scale solar can easily power cities. Ask Germany.",
    "I swear I sae this exact headline 20 years ago.",
    "I swear I saw this exact comment 12 times in this thread...",
    "Wow , resultant waste is only toxic for 3 hundred years - where as ‘used wind ‘ or ‘ post used solar photons' are toxic for ??? How many zeptoseconds??",
    "Big Oil will suppress it.",
    "Can we not say \"nuclear\" this way?  Why not \"...the next big thing in Nuclear reactor technology\"?",
    "Because it's very clear shorthand for exactly that? Do you think people are going to misinterpret it as nuclear weapons or nuclear medicine or something?",
    "We say \"solar\" and \"wind\" to refer to energy technology without qualifying them, and people seem to comprehend those just fine. This isn't really any different.",
    "Edit: Reddit is nothing without its mods and user content! Be mindful you make it work and are the product.",
    "That we should or that govts will? :)",
    "Edit: Reddit is nothing without its mods and user content! Be mindful you make it work and are the product.",
    "nuclear idealist bros..The argument for increasing nuclear power is usually \"yes, nuclear is hazardous, but it's still much more practical than renewables, and way less harmful than fossil fuels.\".There's plenty to debate there, but it's literally the opposite of idealism.",
    "The main arguments against it are time and money. Both pretty insurmountable today.",
    "EDIT: this was wrong enough to remove it. both have a negative temperature coefficient of reactivity..I still vote for PWRs over MSRs",
    "the molten salt reactors I have read about have a failsafe for runaway meltdowns. If the MSR reaches a certain temperature it will drain and stop the reaction. .Another selling point is that they don't need to operate at high pressure like reactors using water to keep the water in a liquid state",
    "Yes, Chernobyl had a drain as well, that's how the elephant foot formed. It melted the core, then drained with chunks of the core into another space. That is a terrible system for safety. \"Oh, it's too hot, let's drain the COOLANT\". A high pressure water system has limited failures in comparison, and if you follow the brittle fracture prevention curves during startup/shutdown/operation, there is no failure possibility. It would be easy enough to prevent operation outside of those ranges..My preferred reactor type leans towards the supercritical light water reactors",
    "That is a terrible system for safety. \"Oh, it's too hot, let's drain the COOLANT\". ..You are fundamentally misunderstanding the system. It is not the coolant that is drained it is the fuel itself which is also the coolant and once it is removed from the reactor it becomes sub critical automatically stopping any further fission and thus cooling down..Really have you never watched any LFTR talks at all? I would start with this one  and get a better understanding of what is actually involved.",
    "oof thorium reactors, never built, always the best. I would like to see a country build one of these for power generation, but it hasn't happened yet. And yea, I don't really know how MFRs work. Everything I learned was about PWRs.",
    "oof thorium reactors, never built, always the best...A thorium reactor has been built which is why we know the science is good. .The reason it was never pursued back then  was politics and policy not practicality",
    "Wait, what? By what mechanism are you suggesting that \"power goes up\" in the MSR? My understanding is that MSRs are also largely self regulating..In MSRs, as thermal energy is drawn from the core faster (e.g. pump speed on the thermal exchangers is increased), if the temperature of the core salt drops, and thermal contraction takes place, causing the uranium in the salt to be closer together, accelerating the reactivity and bringing power back up. However, as heat increases past that point, thermal expansion creates more space between the uranium atoms and slows the reactivity, cooling things...As the water gets hotter, it expands, slowing fission. It balance itself out and is safer to run...Except in PWRs, the water is already under massive pressure. You're not likely to see the type of thermal expansion you need. Instead, you just get much higher pressure (and hydrogen build-up). And, as we've seen, that's incredibly dangerous..There is a MUCH, MUCH higher risk when dealing with the huge pressures of PWRs than with the ambient pressure of MSRs. .In addition, in PWRs, the core is designed to be as close to perfectly insulated to prevent heat loss as possible. Thus why decay heat is so difficult to deal with in PWRs. By contrast, in MSRs, if the heat gets excessive (or power is lost or the engineers decide to turn off the blower), then the freeze plug would melt and the core salt simply drains from the core into drain tanks, specifically designed to halt reactivity and maximize decay heat elimination.",
    "I guess they do have negative temperature coefficient also, I thought it was the opposite of water. .As for the water reactor question, I've watched it happening when operating the reactor. As temp drops the power rises a little, and vice versa. You just adjust the rods to get temp in the right spot. I haven't worked on a plant in 10 years so what I remember is leaving me, but hydrogen wasn't really ever an issue, it gets picked up by balancing the chemicals in the primary loop..My bias is going to be for PWRs since that is what we use in the Navy and we use them for the explicit reason of them being safer to operate.",
    "hydrogen wasn't really ever an issue, it gets picked up by balancing the chemicals in the primary loop...Right, but using water as your moderator does result in hydrogen when you can't continue to pump the water through the loops - which was the situation in both TMI and (especially) Fukushima.  TMI didn't result in an explosion, largely because the release valve was venting slightly the whole time, but .....My bias is going to be for PWRs since that is what we use in the Navy and we use them for the explicit reason of them being safer to operate...... in both TMI and Fukushima, the decay heat was the real problem because the reactor core cannot be both a heat insulator during operation and a passive heat eliminator when not in operation. But with a liquid fuel, you can..The PWRs are safer in nuclear subs because they are like 60MWe. The decay heat isn't really an issue. You won't get the same pressure and won't get the same temps that you do with a 1000MWe power plant. The scale is what turns PWRs from a small, safe reactor that can simply lose all power and safely and passively cool without meltdown, to a giant ball of runaway reactivity that, without power, you can't keep cool and results in either meltdown or hydrogen gas explosion. .That's one of the \"safety features\" bragged about by the new Small Modular Reactors being pushed at the moment. They are still PWRs, but they break the core up into individual modules that are only like 100-150MWe each, which by pure water heat convection can passively cool decay heat even in a power loss situation. .However, they still have the efficiency problems of working with solid fuel.",
    "when you can't continue to pump the water through the loops..When you are not drawing power, you can turn the pumps off, and the water flows due to natural circulation. If there is a casualty, the first thing you do is shut the main steam stops which stops all power draw and slam the rods down to turn off fission. .If you have a giant reactor, you will have a giant volume of water. The temps and pressures will still be the same, and the decay heat wouldn't be able to heat all of that water faster than it would cool just by being offline. .Again, the reactivity cannot run away beacuse the hotter the water gets, the slower fission happens, that is why we use water. As temp goes up, density goes down. Lower density water thermalizes less neutrons.",
    "When you are not drawing power, you can turn the pumps off, and the water flows due to natural circulation. If there is a casualty, the first thing you do is shut the main steam stops which stops all power draw and slam the rods down to turn off fission...That sounds like the passive safety of the newer SMRs which, as I understand it, cannot work in much larger reactors toward that 1000MWe range...If you have a giant reactor, you will have a giant volume of water. The temps and pressures will still be the same, and the decay heat wouldn't be able to heat all of that water faster than it would cool just by being offline...Decay heat is a huge issue in large PWRs. Look into what happened at TMI and Fukushima. They absolutely cannot passively handle the decay heat. ..Again, the reactivity cannot run away beacuse the hotter the water gets, the slower fission happens, that is why we use water. As temp goes up, density goes down. Lower density water thermalizes less neutrons...You're talking about 150+ bar of pressure explicitly restricting thermal expansion to prevent it from becoming steam. And what reactivity reduction you do get is going to represent a pretty small temperature delta. .This paragraph simply doesn't correspond to how PWR meltdowns have occurred.",
    "The natural circulation is used on submarines, using reactors built in the late 70s. I wouldn't call it modern safety. I don't know how the Virginia class ones work, those are newer. I'm not sure why it wouldn't work with a large reactor, it would do essentially the same thing, just bigger..Density still changes even at those pressure levels. The temperature delta to cause power changes is small, yes, around 10-20F you'll see it happen. Power in a reactor is exponential, small temp changes affect that pretty good. The range for commercial is 150-160 bar, that is not that much higher than what I have seen. .TMI shouldn't be brought up, it's one of the earliest designs and every reactor built after that one has fixed whatever issues it had. Fukushima got hit with a tsunami, which didn't help, and I haven't read about or cared about it since it happened almost 10 years ago, but I remember reading issues that it was preventable, if they had kept up with updating the plant, instead of just letting it run as is forever. If you put a power plant near tsunamis, you should probably check it more often to make sure it won't fuck up.",
    "I only brought up TMI and Fukushima, regardless of age or design,  because they absolutely could not passively handle the decay heat. Reactivity had ceased in both cases but decay heat was still present and had to be dealt with because passively waiting would result in meltdown. .Someone smarter than me would have to explain the exact thermodynamics for why a small reactor can passively handle decay heat while larger reactors cannot, but it certainly doesn't simply diffuse the heat into the water.",
    "Andrew Yang is a big fan of this technology, ANDREW YANG 2024!!!",
    "How bout a compromise: Andrew Yang for Secretary of Energy.",
    "Maybe if he gets literally any public experience at all first...",
    "A friend of mine works in this field. This isn't the next big thing at all, this has been an on going project for about 2 decades.",
    "What does he work with?",
    "Oh god I think he calls it LIDO reactors.",
    "Is that the giant swimming pool style research reactor? Or is it a design used for actual power plants?",
    "Neither actually. It's the LFTR reactor. Graphite medium",
    "That's awesome. That's my preference as well. Is LIDO a specific reactor name or a design? I'm not familiar with the name.",
    "I got the name wrong, it's not LIDO it's LFTR, liquid flouride thorium reactor.",
    "Now we should excited about salt water geysers in ONI",
    "Ok. I thought fusion reactors were the next big thing in nuclear?.https://en.m.wikipedia.org/wiki/ITER.",
    "They skipped a couple \"Next\"s.Fusion will be the next, next, next big thing in nuclear.",
    "This looks like the “orb” prop from the Brisco county Jr.  tv show.",
    "Terrapower!!!   Standing wave reactor.  Burns waste nuke stuff.  Could run the us for the next 100. -150 years!!!!   On waste!    No co2!!!   Ever!"
  ]
}