{
  "https://old.reddit.com/r/Tekken/comments/nutm82/what_type_of_character_really_is_bryan/": [
    "a bitch",
    "Bryan can rush down. Hatchet kick and b1 give huge + frames and he has some of the best ch launchers in the game. But he doesnt have much he can do with those frames if you know when to block and when to step. Compare this to a character like jin. He doesnt have the massively plus on hit low or a chunky + mid, but almost every time he gets +6 he can force a 50/50 with f4 or hellsweep. However, bryan has very safe space control tools with 3+4, ff4, orbital and great punishment that bolsters defensive play. The problem is defense and movement is very difficult and requires lots of game knowledge. Thats why most bryans just go ham with the looney toons rushdown..I would say bryan is a defensive space control character with a great ch game.",
    "The character seems pretty brain damaged with how much he can attack with a care in the world with how little defence he has to play and how much stress he puts on the opponents defensive skills. He reminds me of Law except he is pretty much safe on absoloutely everything on block. .Another thing is unlike characters like Paul or Law who have mental frame advantage,Bryan has actual real frame advantage + the ACTUAL fear of the fact that even though you know you have enough frames to sneak in jabs after b1 for instance, you don't because this guy can CH you with absoloutely everything..I am not gonna judge the character yet but from what I'm seeing at the low intermediate level and how every single bryan I have ever played no exceptions plays rush down. I can make the hard assumption this character is braindead.",
    "Bryan is one of those characters that is an absolute menace for players at your level. But i can tell you that if you go to the lab and learn which way to step b1 and hatchet kick, then lab his options when you get hit by these, you will have like 75% of the matchup learned. Bryan is a very strong character so i wont say he is the easiest to defend against but his matchup is probably the second simplest in the game to learn after kazuya. Bryan is one character that i sigh out of relief when i see he is my opponent.",
    "Everyone and their mother knows the Bryan matchup",
    "His offense is based on \"mental frames\". You're not wrong in that it feels like interrupting gets you killed, and people are right to say that his pressure is \"fake\".what that means is that on paper he is not + on block, but in reality the extensions all can counterhit launch you for half your life if you try to interrupt. .The best way to deal with Bryan is to dash block from mid range if they play keepout (his speciality), but with most lower rank gorillas they're just going to spam CH launching strings and Hatchet/B1, so sidestep to the right and block alot",
    "But his pressure isn't fake at all. it is VERY real. Law has fake pressure because usually a lot of the time when he hits you with strings he usually either is - or he is +1 and he lacks the counter hit launchers.  DSS is only a worry in his 4,3 attacks or wr3 but aside from that his pressure is pretty darn fake as he is super punishable..Bryan on the other hand where everything is a counter hit launcher and his main mixup of hatchet kick which is +5 on hit and b1 which is +4 on block doesn't make his pressure fake.",
    "By fake i meant more \"mental pressure\". The frames themselves outside of b1 on block are not \"Forever +\" like say Hwoarang.Mental frames are hard to explain but think of a df1 with a safe high and a CH launching or big knockdown mid. The high is -, the df1 itself is - right? So in theory if they just do single df1s you should be able to jab or magic 4.the catch is that the CH mid is there to make them hesitate. That hesitation right there where you think \"ok i should interrupt but is he gonna do the mid so maybe i should wait\" is what \"mental frames\" are: a \"mental\" frame advantage that turns a minus on block move on paper into a \"plus\" one.\"Real\" pressure relies on them actually being +, like our friend Korean Kick Man. \"mental\" pressure is very common with characters who have CH extensions on strings like Bryan and Geese even though their frames, on \"paper\" are \"not that great\".does that make sense?",
    "true..But once your turn is over and bryan htis you with anything getting your turn back is very hard unless you want to gamble and get CH launched",
    "yeah that's kind of the catch. Bryan's offense has been significantly dumbed down so you're not wrong, due mainly to df21 being +8 on hit (this is what he does to stop you from stepping after hatchet) and the Hatchet buffs..he is more fundamental on defense (no parry, hopkick, orbital can be floated up close) but that's where it ends..I recommend SSR blocking.....alot. you have to make him whiff. Challenging his strings is a bad idea. If you play Jin you can OS alot of them with the parry",
    "Making him whiff is next to impossible with the range he has",
    "Making him whiff is next to impossible..Learn to dashblock and how to dash in and out. His whiffs are very slow and are quite easy to launch, and this is his biggest weakness imo. The trick is to get a good feel for the range on moves like 3+4.It's not different than making Jin's 4 or f4 whiff. These kinds of safe CH launching moves with good rang and/or tracking are very good for controlling space but their whiffs are slow to compensate.Maybe it's a skill thing and not a character thing? If a Bryan player is out-spacing you, then it's going to be tough going in,",
    "Bryan has strong pressure from select pokes, like his 12 has nightmare pressure and eats mashers. His DF1 is a powerful pressure and mixup tool, his B1 is an amazing offense starter and CH tool from neutral, etc. Bryan's aggression is limited only by linearity & sometimes frames..Without sidestep or frame knowledge from opponents, he learns aggression. When the Bryan player doesn't know how to apply 3+4, Orbital, QCB2, etc, isn't comfortable moving, Bryan is gonna do a lot of buttons..You're not going to see most players play 'fundamental' characters well in general. Look at the average Lee, who doesn't poke, barely applies slide, etc; the average Lee is a gambler. The average Kazuya is scared of defense. The average Hei plays like a 50/50 character. .The average Bryan is aggression and strings. Fundamentals take a lot of time..Edit: also yeah, Bryan strings like B2-1-4 made him one of my most hated characters when I was new to Tekken. It's only after learning his strings I began to view him as very respectable.",
    "He his a counter hit, space control, turtle. You respect him too much, a lot of his rushdown moves are minus so he lose his turn and give you an opportunity to pressure or mix up.",
    "he does tremendous damage from relativity easy combos he will only carry you so far if you have bad fundamentals.",
    "How a character is described to play on paper is often very different from how most people play that character online..Vast majority of people online from entry to around mid-level are going to play unga-bunga style that want a monopoly on pressing buttons. Kazuya, Asuka, Alisa are described as defensive characters but online its very rare to find patient players of those characters.",
    "depends on your rank.  I'm low rank so I get pure unga bunga rushdown style bryan opponents.  But the ones I see in higher rank while watching youtube don't play like that.",
    "So I'm not the only one, because that is literarly all I see. When I see Hwoarangs sometimes play more intelligently than Bryan I must say it made me wonder",
    "Im new and in teal and no exaggeration 100% of Bryans Ive fought are pure rushdown. Im still learning pmuch everything but Bryan will probably be the first character I go and lab the specific matchup for...good luck!",
    "100% of all characters are pure rushdown at that level.",
    "new and in teal..Every single character in the game is an offensive rushdown lockdown monster in those ranks. Even Kazuya players just do 124 and df14 into whatever all day",
    "I would describe him as a scum bag big brain.",
    "Counter hit focused turtle, i think.",
    "from my experience he basically Hwoarang with a few less strings where he just can endlessly attack",
    "The \"description\" of a character isn't Gospel. 1000s or even 10s of 1000s of players use Bryan and they won't all play the same. It's just the best way to describe how a character's tools come together. .Even top Bryans don't play the same. Acumajor plays very differently from Jimmy J Tran for example.",
    "You're right. Bryan is designed to be a keepout character. He excels in the mid range and has a plethora of counter hit moves, albeit the moves take a bit of start up so it's best to use them while you are at frame advantage.",
    "He isn't a keepout character when he can attack relentlessly and has a billion strings and counter hit launchers and is basically has never ending pressure. .To be honest Paul seems to fit keepout far better as his tools actually are more about keepout with his qcb moves and punishment",
    "What moves are you getting infinite pressured by?",
    "Bryan is actually really good at keep out. 3+4 is one of the best keep out tools in the game. Add that with an orbital, F4,1 (in my opinion the best whiff punisher in the game) and Mach kick. I can go all day about his keep out tools. Bryan cant attack relentlessly at all unless you let him or he's a literal god with taunt set ups",
    "he obviously can as he takes EXTENSIVE amounts of lab work,not only his moves and his pushback etc,but his frames aswell",
    "If you name me moves I can tell you the salient facts, might save you some labbing. Or if you want it in video form I'll make a video on em. Strings like 3-3, B3, etc, totally murdered me at first; it can feel like he attacks forever. Out of B3 he's got great follow-ups and can SS cancel out for decent frames, 3-3-2 is \"oh, push a panic button? You died.\" etc. .He even has string lows to keep the pressure on.",
    "I love f+4,1. Awesome whiff punisher indeed.",
    "I like that move too. I lowkey picked up Bryan just to do that one move",
    "bryan only gets +frames from b1 (linear and slow) and qcb3 (punishable low which can be read harder than most due to sway animation). f3 is 0 on block but has a bizarre hitbox where it homes it on you if you press but often whiffs if you don't..He's a strong character, but the 'bullshit' moves are mainly orbital, 3+4 (both of which are keepout), taunt and his ragedrive. Low soccer is admittedly very good, but there are plenty of characters with similar lows.",
    "The sway animation isn't even visible if you input hatchet properly lol. That point makes no sense. I agree with the general statement though.",
    "He is a keepout character, as his keepout tools are even better than his other stuff. If you're allowed to play keepout with bryan, your chances of winning go up..The thing is that it's not all bryan can do. He has to be able to do something against turtling opponents too. So he has enough tools to go for a close range dogfight style and then you have to make reads. Sidestep, duck, low parry, interrupt. If you get too passive you're stuck in a loop of b1's and hatchet kicks and that's not good.",
    "Paul seems to fit keepout far better ..He does, but he also has his mixups, lows and is much safer overall which is why he's the better character..Geese by the way basically is just a better Bryan. He even has a few of his key moves like 3+4 (f4 for Geese), and his df1 is basically Bryan's df2 with better frames. He also has the beefy damage and the parry, and a bootleg orbital too! You can play the keepout game with f4 and df2 like Bryan, but also can poke up close..I hate Bryan but I also feel bad for his niche being stolen by better characters lmao.",
    "yes but his mixup is fake unless youre at the wall",
    "Geese doesn't have a tool like B1, F3, etc. Also his only tolerable low, SS3, you can BD all his quick options afterward. Far cry from Bryan hatchet pressure and Bryan's wall game. They're not too similar imo, no more than Kazuya steals Jin's niche because they both have powerful 50/50, keepout and punishment.",
    "For some reason or other, Geese has alot of moves that are described as \"Bryan's X but worse\":.​.df1 string (bryan's df2). Even the pushback properties on df23/df14 is nearly identical..F4 (Bryan's 3+4).DF2 is quite similar in usage to Bryan's mid homing moves.Fisherman slam.strings that go mid-high or mid-mid with a CH option, but this has become very common across the cast so you can forget about this one..Their neutral games are quite similar as well, down to having strong ws punishment, standing punishment and a 14f block punish launcher. One has better poking than the other, while Bryan has the safer movelist and better low. They're not identical at all of course, but there are quite a few similarities at least to me. I see your point though.Also is it just me or do they kinda look alike? Not in-game. If you put that Portrait with maskless bryan (the CGI one) and put Geese's next to it. they look really similar lol",
    "Assuming you're past the point where you can block his snake edge on reaction. He doesn't really have anything that's scary on rushdown or pressure. Likely you're letting him get away with shit that's 2 slow (IE you're waiting for your turn too long or you aren't using fast highs/mids) or you aren't punishing or ducking correctly. (One of the check's I'll do is see if people aren't ducking or punishing his d/f+2 strings and I'll abuse them if not, or are waiting after a d/f+1 (its 15f)).It's different at the wall if the player is good with taunt cancels, but really Bryan shouldn't be able to continuously pressure you, if he's getting away with it, hit up practice mode.",
    "why are you getting downvoted. it's exactly that.Bryan is Plus on Hatched Hit, and on B1 Grd. Maybe F3. Maybe mental frames on d/f1.that's it.If a Bryan rushes you down, you're pressing in the wrong situations. playing towards his CH abilities.wrong tactic.",
    "1+2 and df2 also have strong extensions to make people scared of pressing. He has quite a bit of those.",
    "yeah, ok agreed. but judging by OPs words, he isn't aware of the risks or frame disadvantages Bryan has..it's just a whiney post. Bryan is not rushdown, it's just rubbish.",
    "He has +frames on hatchet, b1 on block. He has strings with ch follow-ups that he doesn't have to finish. His df1 catches sidestep attempts and is risky to try and punish. He also has a good long-range high-crushing low (d3? d4?) That crushes jab attempts even after he's minus frames. You have to navigate all of that, and also take into account that he's free to do a move and then sidestep and punish your button press when he's negative..From my experience, good Bryan players use movement and string follow-ups to punish attempts to press buttons immediately, conditioning you against doing so, then use fast moves at -frames which beat you because you've delayed your attack due to the conditioning, and delaying their attacks even when they are +frames to match your own delayed button press for a ch, or simply continue doing hatchet/b1 if you really don't do anything..It's not that Bryan players spam these pressure tools without any thought. I haven't played Bryan, but I think he requires a lot of mindgames to play aggressively and match your aggression to the opponent's mind state. But skilled players are absolutely capable of doing it. If a player doesn't do anything and blocks three b1s in a row, it's because the Bryan player knows he's not going to do anything.",
    "Let me give u a question. Let's just say that you r learning a new language like japanese and I ask u to translate a few words from japanese to English but u couldn't translate all of them. Does that mean the language is too difficult to translate those words or those word doesn't exist? .It's basically the same thing if I give u character and the opponent doesn't know how to deal with a few string or u only know how to play aggressively does that mean his a aggressive character. You have to take account of character matchup and other stuff",
    "He can attack endlessly thx to the buff of his d+2 now being -2 on block so you can pretty much make opponent guess by doing jab, d+2, d/b+3 u+4, qcb+3, f+3, or you can keep them out with ff+4, 3+4, u+4, d+4 etc.",
    "Cool cyborg. That's his character.",
    "He's a cool one.",
    "He can be played aggressively if you have a read on the opponent and their timing. If the opponent is not predictable then he's not really suited for an aggro playstyle.",
    "Bad mother fscker.",
    "Aggressive Bryan play relies on scaring the opponent with his varied followups to different buttons and good reads on impatient players, as well as risky reads like b1 in their face to keep pressure going, or reading a high and responding with Snake Edge, etc. Basically, he's unorthodox, and that applies to his style of pressure as well, as TMM said.",
    "Spacing, CH, Frame Advantage"
  ]
}