{
  "https://old.reddit.com/r/explainlikeimfive/comments/z2iwm/eli5_what_are_fractals/": [
    "Great ElI5 post. Similar to the question of \"how long is a the coastline\" which can be accurately described as infinite if you just measure on an increasingly small scale.",
    "[deleted]",
    "In real life, yes, but the platonic mathematical coastline could be infinitely long.",
    "Is this Zeno's Paradox? Hasn't this been refuted?",
    "ELI5: Zeno's Paradox...",
    "Suppose Usain Bolt and a fat person raced against each other, and Bolt gives the fat person a 100 meter headstart. If Usain Bolt is going twice as fast as the fat person, that means that by the time Bolt has run 100 meters, the fat person will be 50 meters ahead. When Bolt covers those 50 meters, the fat person will be 25 meters ahead. When bolt covers those 25 meters, the fat person will be 12,5 meters ahead. And you can continue this in infinity, with Bolt never catching up to the fat person. That is Zeno's Paradox.",
    "Technically Zeno had three paradoxes, each an attempt to show that movement of any sort was impossible.",
    "The problem being that, while there are infinite steps when defined this way of \"catching up\" with the fat person, the time needed for those steps approaches zero, and in fact, the time to catch up is finite even though there are infinite steps. Zeno didn't realize this, though.",
    "Each increment takes less time thus is can be shown that that Usain will eventually catch up to the fat guy.",
    "Here goes: over infinity the gap between two runners will never truly be reached even when the second place runner is faster. I think that's Zeno",
    "Of course the response to Zeno's paradox is that as the gaps become smaller and smaller (infinitely small,) the space is crossed infinitely fast.",
    "That's the response to it? Thanks. I really never heard the opposite (or never really bothered to look it up). Learned something new today.",
    "The size of your measuring device is the end. Depending on what that device might be...a lot is possible.",
    "Thanks, my new goal is to make a posts that are as if I were explaining it to my 5-year-old (that doesn't exist yet)....soon....P.S. Happy Cake Day?!",
    "Excellent use of \"OOC\".",
    "even longer than your sister takes in the bathroom!..What's she doing in there for so long, anyways?",
    "You know girls, always doing their hair and putting on makeup!",
    "A fractal is a mathematical set with a pattern that repeats indefinitely.The most common usage of the word is for patterns and other such mathematical art. Basically, you start with a Shape with a Pattern A, and repeat pattern A off the shape, with the pattern both increasing in overall complexity, and with every iteration, the number of repetitions of the pattern also increases. .These pictures should help:.http://mathworld.wolfram.com/images/eps-gif/Fractal1_1000.gif.http://upload.wikimedia.org/wikipedia/commons/f/fd/Von_Koch_curve.gif",
    "What makes fractals so important in mathematics other than being pretty and self repeating?",
    "They're found naturally, brain cells and broccoli, that's quite remarkable in itself. Like finding the number e popping up in unexpected places, it serves to reinforce the idea that we're probably onto something special with maths..To me, that's important.",
    "Fun fact - Geckos have extremely fine, 'fractal like' hairs on the pads of their feet.  These extremely fine hairs are so small, that they allow the Gecko to bond with the surface on a molecular level thus enabling them to climb nearly any surface.  ..Geckos have no difficulty mastering vertical walls and are apparently capable of adhering themselves to just about any surface. The 5-toed feet of a gecko are covered with elastic hairs called setae and the end of these hairs are split into nanoscale structures called spatulae (because of their resemblance to actual spatulas).  The sheer abundance and proximity to the surface of these spatulae make it sufficient for van der Waals forces alone to provide the required adhesive strength..Source.",
    "So if a gecko climbs a human arm, it is digging into your molecules?.Why does that weird me out?",
    "Geckos like to get... intimate.",
    "It's not even touching you when it's climbing on your arm, not at all!.http://www.youtube.com/watch?v=yE8rkG9Dw4s",
    "It's almost as if I'm wearing nothing at all.",
    "[deleted]",
    "Stupid sexy Flanders.",
    "TIL if I ate a billion bananas, it would give me radiation poisoning.",
    "Because THERE'S A GECKO ON YOUR ARM!!!",
    "So what you're telling me is that we need to splice gecko DNA with spiders and we'll have Spiderman?",
    "Pay it forward..Edit - More recent update.",
    "However, the school's Pentagon contract expired and researchers now are looking for commercial backers to further develop Geckskin..This is how super villians are made...",
    "I know it may be humorous, but yes, it would work.  Presuming our hands were /far/ bigger.  This is one of those \"issues that does not scale up to human size\", like water striders walking on water.   .If your weight/contact surface area was the same ratio as a gecko, then yes, it would work.",
    "I think you need a human in that equation...",
    "The only known surface they can't go vertical on is teflon.",
    "Probably the most interesting fact I've read bout any animal ever!",
    "Wow, makes me wonder what we could achieve with fractals in nanotechnology.",
    "e is the baddest assed number",
    "Please explain.",
    "It's all over the place in basically every level of math and science. Like I could show you one instance where e appears, and it wouldn't seem very awesome. But then I could show another, and another, and another... it's a topic you could study for months or years. Eventually you start to get the feeling that there must be some underlying connection to it all, else how would this same very specific number keep appearing in so many disciplines?.A good place to start would be its definition. It's defined as (1 + 1/∞)∞ . It's really difficult to imagine what that number could be, though. The inside part is the smallest number bigger than 1, so it's like (1.00000000000000001)∞. What is that? 1∞ = 1, but (anything bigger than 1)∞ = ∞. So by definition, this is sort of an unstoppable force/immovable object battle between 1 and ∞. Strangely it balances at e = 2.7182818.The next biggest significance would be this extra mind-blowing equation, Euler's Equation, which ties exponentiation, complex analysis, and trigonometry together: eix = cos(x) + i*sin(x). So e is also fundamental to trigonometry (and therefore, anything in the universe which oscillates)",
    "I really enjoyed this math explanation! First time something involving something complicated in math that has made sense. I really hope you will keep doing this with other math related questions!",
    "[deleted]",
    "This isn't r/math... I was assuming he didn't know about limits. .I mean yes, everything you said is right, but the guy who asked the question probably doesn't have enough context to understand any of it. You have to keep your audience in mind when answering a question like this...You could similarly conclude that e2 is an \"unstoppable force/immovable object battle\" between 1 and ∞ since e2 = (1 + 2/∞)∞ ...Okay, but that speaks more to exponent rules than it does to what e is about, and again, this isn't a rigorous discussion by any means...I'm sorry but this is complete bunk..Liar, there's no such thing as an apologetic pedant",
    "I liked teganyavo's explanation. I've heard e all my life, and never really understood it until now. It actually gave me tingles and made me smile.",
    "Liar, there's no such thing as an apologetic pedant..... I'm saving that for later, that's brilliant!",
    "It's also easy to memorise it to more precision than you'll ever need, due to the repetition of its numerals indexed 2 to 5 when written out in decimal: 2.718281828",
    "It's an absolute beast! eiπ = -1 blows my mind every time.",
    "That's just a special case. In general, r eiφ = r(cos φ + i sin φ)",
    "Oh, I'm aware. They're fond of ramming that one down your throat in year 1 Algebra at my university. Your characters are prettier than mine.",
    "It blew my mind the first time I realised I could just use unicode and use capslock to switch to a greek keyboard layout instead of command-escaping greek characters in LaTeX. Επιστήμη!",
    "You mean human beings don't look up on Character Map every time they need a symbol? Shit.",
    "That's ridiculous. Everyone knows the way you do it is you open Internet Explorer, bing google, open the link in firefox, google wikipedia, then search for the full name of the symbol.",
    "Coastlines are technically fractals. Paridoxically countries border lengths are mathmatically infinite lengths..Wiki Article:http://en.wikipedia.org/wiki/Coastline_paradox",
    "You can extrapolate the length of anything to be infinite if you just keep zooming in.",
    "Bad things to say in bed!",
    "\"I wish your dick was infinite!\".\"Only so it'd fill your infinite hole!\"",
    "This comment has been deleted due to failed Reddit leadership.",
    "Actually, no, that is one of the reasons fractals are remarkable. If you have a finite segment of a straight line, it does not matter how much you zoom it, the lengh is always the same..The reason the coastline's lengh can get bigger when one zooms it, is because one is able to see more and more curves and intricate details. A straight line does not have \"details\", it is the same \"all the way down\".",
    "Weeeeeee!!!",
    "I was chopping up broccoli today and it seriously reminded me of a fractal. Nice to know I'm not too crazy",
    "Here's an article on Benoit Mandelbrot, most famous for the Mandelbrot Set fractal. The beginning talks about his findings regarding fractals in electric noise at IBM. He then began to find similar structures in all sorts of places. Really good example of fractals in nature inspiring fractals in math (and art)..http://www.telegraph.co.uk/news/obituaries/science-obituaries/8069558/Benoit-Mandelbrot.html",
    "Here is a picture of a cauliflower that forms a natural fractal.",
    "Here's someone using a Hilbert curve to make an approximate model of the brain:.http://tinylittlelife.org/?p=279",
    "Fractals are a way to make a very complex shape using a simple equation or instruction. .If you look at this image you see some examples of fractals. Now only look at the column on the right, the most complicated shapes. Imagine trying to explain to someone how to draw them. If you didn't know these shapes were made from a pattern, they'd be very hard to replicate. .However, you can easily explain how to remake a fractal. For example, here's how to remake the bottom image. ..Start by drawing a triangle with equal sides on a paper. .Make a dot in the center of each line of the triangle.Connect those dots to make a new triangle with equal sides- color it in..This makes three new blank triangles around your colored one. .Repeat steps 2 and 3 in every uncolored triangle. Repeat again with all the uncolored triangles you can find...For this reason, fractals are often found in nature. Fractal branching is something you probably see every time you go outside..Imagine a seed. A seed needs to grow into a tree, but it'd be hard to fit all the information of \"what a tree looks like\" into a seed. Seeds aren't big or complex enough 'know' the blueprint of a tree. But what a seed can do is grow a certain amount, and then branch in to two. Then the seed grows a certain amount again, and then each of the branches makes more branches. When the seed has a lot of branches, it can have a lot of leaves, which means the tree gets a lot of air to keep it alive. The simple seed becomes a complex shaped tree, just by being able to make branches at the right time..Your lungs also work with fractal branching. Each of those little branches in the picture helps bring oxygen to capillaries, which takes the oxygen to the blood, where it can help your body do work. By having many small branches, there's a lot of places the capillaries can get oxygen, making your lungs much more efficient, and meaning you can do more work..Lots of people have noticed that fractals are a good way to make a complicated shape. Here's an animation of a computer using a fractal pattern to make a picture of a mountain. If the computer didn't know the pattern, the mountain probably would have had to be drawn by hand by a person, which would be a lot more work. People also use fractals to make antennae- by having a fractal shape, this small antenna can access a lot of different frequencies without taking up extra space..Edit/final thoughts: While fractals aren't a big influential part of math, they're a big influential part of life, and you can use math to make them. Math is a way to convey the instructions on how to build a fractal, and then people in all sorts of different fields can use them. .Or just look at them, because they're cool.",
    "They have interesting analytic properties and are used as counter examples to a lot of claims. http://en.wikipedia.org/wiki/Cantor_function",
    "For example the region bounded by the Koch curve OP linked to has infinite perimeter but finite area.",
    "Snowflakes, trees, lightning, blood vessel networks, river networks, mountain ranges, galaxies, spirals, motherfucking romanesco (look at that thing, it's beautiful) and, I'd argue, every living thing on our planet and everything in the universe follow self-repeating, fractal patterns, from simple to more complex. .Think of your body like a bunch of straight lines and you'll see what I mean. One large 'torso' line breaks off into several 'limb' lines, which then break off into your 'fingers' and 'toes'. Trees and plants are exactly the same way, they just evolved under highly, HIGHLY different circumstances. .So understanding fractals, in my mind, is one of the most important things that humans can understand. But I'm not a mathematician (although my father is), so maybe don't consider anything I say.",
    "So even waves are fractals, aren't they? I could probably think of even a ray of sunshine as a fractal, since even a straight line is conceptually a self-repeating structure of smaller straight lines (down to the Planck length).",
    "I dunno if those are fractals, but they are absolutely self-similar, repeating patterns. .Once you get down to things like waves, it starts to unfold that many things are in binary states of being: in/out, up/down, inhale/exhale, etc..Tide goes in, tide goes out. You can't explain that.",
    "(please excuse the arbitrary use of numbers here)  so imagine trying to measure the coastline of an island...first, you do it with a mile-stick.  you find that it's 100 miles around the island, but you notice as you work that the coastline deviates from your rigid mile-stick.  you can't accurately measure the island in straight mile increments.  so you try it with a yard stick...much more accurate than a mile stick, right?  but when you're done, you find that the island is now 120 miles around...what the?!?  that can't be...or can it?  the smaller increment allowed you to measure more accurately, right?  so you were better able to trace the coastline and get an accurate measurement.  now, you're really jazzed, and you want to get the most accurate measurement you can, so you use an inch-stick.  now, the island measures 130 miles around...and if you think about it, the smaller the increment you use to measure, the more accurate you'll be and the larger the island will \"become\".  the island isn't changing size, but your ability to better follow the outline is making your total measurement larger.  of course, calculus would imply that there's some limit to this...as the measurement becomes smaller and smaller, you must approach some maximum circumference for the island...but during the journey you're experiencing the phenomenon that lead to the creation of fractal mathematics...fractals can be used to describe this \"roughness\" or \"complexity\" (of the island's coastline) when other maths fail...at least as i understand them.",
    "[deleted]",
    "Ah ! Thanks. Was hoping to see this in this thread..That's one rare case when you need to read the book and see the movie..The book contains wonderful explanations from Malcolm. They translated it with a 1 minute explanation of Chaos theory and \"life finds a way\", it's much deeper in the book. (I found the fractal drawings awesome when I first read it... I didn't even know what a fractal was back then...)..The movie contains CGI dinosaurs and Jeff Goldblum.",
    "Fun fact: A fractal is one way you can have an infinite surface area in a finite volume. That's a pretty useful feature.",
    "But the volume would be irrational.",
    "Honestly, they are not very important in mathematics.  They're just very easy to use to convince the general public that math is cool.  More fundamental/important objects in mathematics are just not as appealing to the lay person..EDIT: to the downvoters, do the following.  search mathematics publications for the phrases: \"scheme\", \"symplectic manifold\", \"derived category\", \"D modules\", \"Lie group\", \"representation theory\", and \"fractal.\"  Now lookup the wikipedia article on each of these.  Now look how few publications are about fractals while its wikipedia article is sexier to the lay person than the articles on the other topics.",
    "Some naturally occurring shapes are fractals - coastlines for example. So learning how to mathematically describe and understand fractals is of more than just theoretical importance.",
    "Scale invariance shows up in a lot of places aside from fractals. .In nature, for instance, plants, clouds, mountains, coastlines, molds, etc, exhibit scale invariance - ie, if you are looking at a part of it without any context, you can't tell whether you are looking at a very small part or a very large part. Even the way stars and galaxies cluster together is thought to exhibit scale invariant patterns. Understanding the mathematics in fractals is key to understanding how and why a lot of natural phenomena occur the way they do.",
    "And it's worth mentioning the Mandelbrot fractal, whose formula has an interesting feature: it is a \"feedback loop\". That means the answer to the equation, it's \"output\", is fed right back into the start, as the \"input\". So no matter how far you zoom into this fractal, there will always be more, because the act of zooming adds new input that is fed through the equation, and more fractal is made. It technically has infinite detail..This also means that shifting your view a tiny bit will give you a completely different result, even if you should be looking at the same thing, except \"a little to the left\". And the more you zoom the more different it becomes..Fractals are incredibly fascinating, huh?.Edit: and let us bot forget that there are fractals in nature. All over the place. A branch is a kind of fractal. The tree trunk splits into smaller lengths of trunk, and then those too split into smaller lengths, and then this continues till you get branches, which keep splitting over and over until you reach their tips.",
    "Yea kindof an analogy for reality itself...",
    "It technically has infinite detail....A line has infinite detail too.  So this is disingenuous....This also means that shifting your view a tiny bit will give you a completely different result, even if you should be looking at the same thing, except \"a little to the left\". ...Once calculated point will always have same result. Shifting your view a tiny bit will give you same results for all points you already seen. If you are looking at the same thing then you are looking at the same thing. There is no magic \"\"start of view port\"\" that would affect Mandelbrot....And the more you zoom the more different it becomes....That is a feeling of revealing previously unseen detail.  It was always there, just not visible.  It would be same as zooming across cosmos and then down to earth, and then to a city, then to a human, then to his cell structure, and then to atoms.  It always was there, you just see different details.",
    "Well, yeah..But first off, what i mean by my second point, is that if you zoom in to one point, look at how it looks, and then do it over with the view shifted slightly, and look over at the previous location as it drifts by, it won't be the same. If we imagine that you're zooming in on a different location, so the previous location is now at the edge of the screen, you'll see that it's not quite the same, as it drifts by..And the revealing more detail thing isn't just about seeing more detail. The detail is generated by the act of looking for it. When you zoom in, the output is fed back into the input, and you get new detail. So you can see it as just zooming in on detail that was always there, or you could take it for what it is, and realize that the detail is being made as you look for it..And by infinite detail, that's what i mean: if you look closer, more detail will be generated for you to find, as the process of zooming in to look for it creates more. This is due to the feedback loop function.",
    "When you zoom in, the output is fed back into the input, and you get new detail....No, when you zoom in, the points previously calculated don't have to be recalculated, as they will be same as before..The only time you have to recalculate previously calculated points is when you ..change the depth of the feedback loop.change the accuracy of calculations..Mandelbrot Set.There are few nice tricks (outside of ELI5, but within primary school) ..Mandelbrot lies on complex plane..This means that that a point p has two components x and magic y.magic y is a complex number with square root of negative one, denoted by special letter i.so our point is p = (x,yi).now, assume we can move a point p by multiplying it by itself.so p2 = (x , yi) * ( x, yi).now, lets write a point as if it were a sum (since complex part always is separate from real part, so our x never mixes with y).so p2 = (x + yi) * ( x + yi).now we can multiply this out.so p2 = (x * x) + (x * yi) + (yi * x) + (yi * yi).now, recall how i is really square root of negative one?  If we have (i*i) it just becomes a negative number.so p2 = ( x2 - y2 ) + 2xyi.we can this many times.so p3 = ( x3 - 3xy2 ) + (3x2 * y - y3 )i.anyways, each time we get a new point somewhere else.the big question is, if we keep multiplying, will this point ever escape towards infinity?.how can we know if a point is mowing towards infinity? once it's radius (distance from centre) is more than 1, we know it escapes towards infinity.how to check radius? Pythagorean short theorem.  Take x2 + y2 = r2 . So as soon as r2 is more than 1 we know..so we calculate p2 and check if that point is outside our radius. .if it isn't, we calculate again, p2 and then p4.and again p5 .and so until we reach some pn.at which x2 + y2 > 1.now, this n gives us the colour of the fractal.this is the feedback loop...notice 1: we stop calculating ..some points will never have x2 + y2 > 1 ... ie: p=(0,0i)..so pn will never have r > 1.so there is some cutoff point when we stop calculating feedback loop .this is usually the centre of the Mandelbrot were the feedback loop gave up.it has been proven that the area of this is equal to 1..notice 2: once calculated point won't change..if we find some n for which pn has r > 1, then we know it.it doesn't matter what zoom we are at, that point is calculated..notice 3: edges can look different depending when we stop feedback loop..when feedback loop stops, we don't have a guarantee that point calculation was exhausted.when we increase the counter on the loop we might find out that eventually a point does have an n for which pn has r > 1..notice 5: cheating software..many Mandelbrot rendering software cheat to speed up display.some will render every other pixel and interpolate. One can render quarter of the pixels and interpolate rest. This would give general view, and let system catch-up with calculations.some software will try to avoid the whole area around to p=(0,0i) because that will push the feedback loop to its max. (slowest part to render)",
    "Wow, thanks! I've been misunderstanding the Mandelbrot set entirely, or i've read poor explanations of it! :)",
    "A fractal is a mathematical set with a pattern that repeats indefinitely..A bit of a pet peeve of mine. They don't have to be self-similar. They just have to have fractal dimension exceeding their topological dimension..Of course, that's hardly ELI5.",
    "So glad someone pointed this out! A pet peeve of mine as well- right up there with calling espresso 'expresso'..I know the self similar stuff is easier to draw, but Random walks (which have no self similarity), are really much more 'typical' examples of fractals.",
    "Is this similar to recursion in programming? I remember in HS we first learned recursion by creating a program that would draw trees. We came up with a single formula, that when regressed n times, would create a rather complex looking tree. Much easier than if we tried writing an entire set of code that drew it line-by-line. So an extremely complex design could be created with an extremely simple mathematical expression.",
    "A fractal is a mathematical set..Not ELI5 and not accurate. Fractals aren't always sets, afaik.",
    "More to the point: they're not always self-similar (have a pattern that repeats indefinitely) to be honest. This is only true in very very specific circumstances- and only roughly true in pretty specific circumstances (where local Hausdorff dimension= global Hausdorff dimension)- in many cases it is actually not true at all..P.S. In my experience a fractal is a metric space (Edit: possibly) with an associated measure. I'm not sure I've seen one that isn't a set- could you give me an example?",
    "How is the dragon fractal, for example, a set? By means of the limit set?",
    "Yep. The limit is taken over the union of iterations. The infinite union of such iterations, each being a set, gives a set.",
    "Fractals are sets, yes. Do you have an example of one that is not?",
    "Everything is a set? It's not the most useful way to describe it, especially in ELI5..How does the dragon fractal fit in with sets, for example?",
    "I don't mean the whole \"everything is a set\" mantra of set theorists. Fractals are actually sets in a very straightforward way..Dragon curve.Everything that's black is in the dragon fractal set. (Ignore the dots in the middle).",
    "But that's only a rasterization of a particular iteration. In reality each step is made up of infinitely thin lines that completely change on the next iteration, and the fractal itself isn't any particular iteration.",
    "But that's only a rasterization of a particular iteration...Well of course...and the fractal itself isn't any particular iteration...No, it's the limit set. That's still a set.",
    "You are correct, a formula that describes a fractal does define a set, but the two are separate things.",
    "The gifs were really helpful, thank you. Although, bringing it back to five-year-old, what's a mathematical \"set\"?",
    "Just a collection of things. For instance you could have a set of chairs or colors or schools.",
    "Ah okay, it is that simple after all! Thanks :)",
    "Yeah. Set theory is the basis of all math so it has to start from a rather simple place lol.",
    "But it's the wording, \"set theory\"; it sounds so much more imposing than \"groups of stuff that can be counted\". Much quicker though...",
    "I'm just saying it comes from basic things. The actual theory itself can get quite complicated.",
    "Fractals are also used in cell phone antennas, each step increases the surface area, but not the overall size..They were used in star-wars 3 to simulate a lava stream scattering around after hitting something.",
    "Those tidbits are from this great documentary, as I recall!",
    "The most common usage of the word is for patterns and other such mathematical art...Unless your friends are into drugs.",
    "druuuuugs.",
    "explain LIKE I'M FIVE",
    "Holy crap!  Is that a septivignitiforce?!?",
    "Heh, Triforce.",
    "I can't help thinking of the Sierpinski triangle every time I see a Triforce. Must... control.... need... triangles!",
    "Don't really like that first image as it doesn't show scale, but that second one is fantastic.",
    "I've heard that fractals can help predict the stock market. Is this true, if so, how?",
    "You should add this video on there too! http://www.ted.com/talks/lang/en/benoit_mandelbrot_fractals_the_art_of_roughness.html",
    "Fractals can actually be found in nature quite frequently. One example is Romanesco Broccoli, which my former math teacher was in love with (for obvious reasons).",
    "Also, just regular broccoli, or anything with a tree structure.",
    "Yes, but you must agree that romanesco is much more fascinating looking than those others",
    "does this have anything to do with the TIL post about that german philosopher?",
    "yep, guilty. Never understood what they really were.",
    "totally - that's what I thought when I saw the question come up on my feed",
    "I think it is. Funnily enough I was about to google it when I noticed this thread.",
    "I love being able to relate posts I see in this sub with other posts. And it happens way too often.",
    "Imagine you're at the beach. Go find a stick and draw a big triangle in the sand. Now on each side, draw another triangle about one third the size. Do the same for each of these new, smaller triangles. Just keep drawing triangles until your stick won't do the job any more..That's where we let computers take over. They're really good at figuring out what things look like even if they're too small for us to see. You want to see what it looks like down there? Well then just scroll that mouse wheel and have a gander. You'll find that it looks the same all the way down, no matter how far out or closely you look at it. That's a fractal. Pretty cool isn't it, maths?",
    "actual answer for a 5 yeear old. pretty good!",
    "I thought that was the point of this subreddit, and 5 year old me wasn't too bright. Thanks for that!",
    "Is there somebody that actually studied math here?",
    "Explain Like I'm Five...\"Fractal\" refers to a \"fraction of a dimension.\"  We understand that a flat line is 1D, Super Mario Brother is 2D, and Avatar is 3D, but it is hard to represent 1.26186D.  Dimensions can get funky when you try to understand strange objects that repeat patterns and fractal geometry attempts to deal with this mathematical Bootsy Collins.  For example, broccoli is a higher dimensional object then cauliflower..Now just for fun (you will only need some basic algebra).Explain Like A Pro....Imagine a 2x2 square with an area of 4.  Now double it's size.  This sound easy, but ask yourself which of its sizes you are doubling.  If you double the length of its sides, you have a 4x4 square with an area of 16.  The original area was 4, so while you have doubled the length of a side you have actually quadrupled the area..HRMMMM.Now imagine a cube that is 2x2x2 with a volume of 8.  If you double the lengths of the sides, you get a 4x4x4 cube with a volume of 64.  You have octupled its area this time..HRMMMM.If we represent the scaling factor 2 with the variable x....Length Size: 2x = 4.Area Size: 2x * 2x = 16.Volume Size: 2x * 2x * 2x = 64..or.Length Size = 2: 2 * x^1 = 4.Area Size = 4: 2 * 2 * x^2 = 16.Volume Size = 8: 2 * 2 * 2 * x^3 = 64..or.Size = Size * Scaling Factor^Dimension..This means that an object's dimension can be defined by the exponent over the scale factor.  Got it?  Coooool..So lets look at the Koch Curve and see if we can figure out its dimension!  Make sure to click the link so you definitely can visualize the shape!.First, a Koch Curve starts with a 1D line.___..but you erase the middle 1/3rd of that 1D line and draw an equilateral triangle, which gives you 4 line segments of equal length.._/\\_..So, is this object 2D now?  I dunno.  Like I said, it's Bootsy Collins all the way down..Now erase the middle 1/3rd of each of those 4 line segments and create another equilateral triangle in the gap, which gives you 16 equal length segments.  Just keep erasing the middle of each line segment and adding a triangle until the universe ends.  OK, that's a Koch Curve..Using the method from before we know we are looking for the size, so let's make an equation.  First, size goes on the left of the equal sign.Size = ???..Now let's describe the object.  First, we know that we are taking this 4-sided object._/\\_..and then adding stuff on all 4 of those line segments.  So let's say.Size = 4 * ???..Now the fun part.  We know that it is 4 line segments, but each of those line segments is actual itself and if we zoom into one of those, we see the same shape for infinity.  So we say.Size = 4 * Size * ???..And if we go back to the beginning, we know that the dimension is the exponent number above the scaling factor.  So, now we have a complete equation.Size = 4 * Size * Scaling Factor^Dimension..If we remember that the original shape was a line.___..and the we erase the middle 1/3rd to make._/\\_..we know that the scaling factor is... 1/3rd, which means we've got.Size = 4 * Size * (1/3)^Dimension..We've got a Size variable on both sides of the equation.  That won't do..1 = 4 * (1/3)^Dimension..Almost there.  Let's divide each side of the equation by 4 to get.(1/4) = (1/3)^Dimension..And let's solve for Dimension of a Koch Curve.Dimension = Log (1/4) / Log (1/3) ≈ 1.26186..TL;DR Fractal geometry helps us understand objects that have a dimension that is not a whole number.",
    "This is so exciting for some reason.",
    "I know, right!?",
    "wait don't fractals only occur in the imaginary number plane",
    "Ah yes, that would happen at the very last step.  In order to simplify the equation, I made the assumption that the Dimension variable was a positive number.  If it is negative, the logarithm algebra gets a bit harder to follow.  So, instead of .(1/4) = (1/3)^Dimension..becoming.Dimension = Log (1/4) / Log (1/3) ≈ 1.26186..you actually end up with.Dimension = (Log (1/4) * 2 * i * pi * n) / Log (1/3).where n = whole numbers.where i = imaginary numbers..And your solution becomes plot on a graph.",
    "This is fun, because you can look at pretty things!.Look at this first.Then at this.Pretty cool, right?.These shapes are not drawn by hand but their edges are calculated. There are some formulas in math that \"never end\" when drawn as a graph..EDIT: note that the colors are not part of the formula.",
    "After looking at this and having previously read that there is a man that can see in fractals my mind is now the most blown it has ever been.",
    "Take drugs, see in fractals. Blow your own mind!",
    "Take LSD.See fractals",
    "More like smoke DMT go play in fractal land",
    "Mescalin consist of pretty much all visual fractals",
    "How's it compare to LSD and mushies?.I have a friend who makes his own mescaline tea, I'm going to try some eventually.",
    "LSD vs. DMT",
    "See in fractals? What does that even mean? Every human can do that. You can always just go nearer....Or does he see shapes and thinks of the formula?",
    "Blam",
    "I thought that would have been something a little more substantial.",
    "The video makes me wonder if the universe is just a fractal.",
    "Can you expand on formulas that never end? For example, if you plot a line (sine wave), it never ends, right?",
    "If you enjoyed that, here are many many more 3D fractals, and also an interactive fractal zoomer.  You don't have to know a thing about the math involved to appreciate the beauty of them.",
    "Fractals are, in a nutshell*, 'Pictures of infinite detail'. Like a dog with fleas, each of those fleas has fleas, their fleas having fleas and so on for ever. They are important for a few reasons:.Philosophically, they show us how something of infinite complexity can come out of a really simple process (IMO Julia sets are a great example of this). I like to tell my students that, depending on your perspective, this either proves that we don't need a god, or that it testifies to the beauty of the logic god gave to the world (it's up to you to decide!)..More concretely, though, they come up in all sorts of places. You see, when we look at, say, a graph of the stock-market from a distance, the spikes look detailed- really detailed! And since we can imagine there'd be even more detail if we measured every half day or minute or second or whatever, we can think of stock graphs as being a picture of infinite detail- a fractal..One way fractals can appear is as part of something called 'chaos theory'- which is the theory of stuff that looks random, even though it's not. This sort of stuff happens when no matter how well we measure something, if we can't measure it perfectly (like when your ruler doesn't go below millimetres- and the actual answer is in between two of the marks), we can't predict the outcome. When you flip a coin for example (this isn't actually chaotic- but it's just to give an idea), no matter how well you control your flip, you can't predict heads or tails, even though in theory you could have with physics..In chaos theory, fractals occur as something called strange attractors. An attractor is like a magnet, which stuff is drawn to as time goes on. Like if we look at all of the numbers, and say every minute we halve all of them- halving again the next minute. Each time, every number is getting a little closer  to zero- so zero is acting as the attractor. It turns out you can quite easily make physics equations which see more complicated things acting as an attractor. If the attractor is a fractal, this is called a 'strange attractor' and means the system is chaotic. .The most famous example of a strange attractor is the Lorentz attractor which governs our weather systems- that it leads to chaos is the origin of the famous saying that \"When a butterfly flaps its wings in Brazil, it can cause a tornado in Texas\"..Understanding fractals is the secret to understanding the apparently random in a clockwork world. They are pretty and philosophically deep, but also essential tools in handling complexity...*The technical definition is more complicated and has to do with how we measure stuff. I'll add an ELI5 of that later if anyone wants it- it is pretty cool!.(Edit: fixed link)",
    "I want it!",
    "Ok so, fractals are graphical representations of, usually, quite simple mathematical expressions. .Think of the pixels in the picture like coordinates on a graph, each one has a different value for x and y. A fractal equation uses these x and y coordinates to work out the value (read: colour) of that pixel..The clever bit that makes all the patterns is that the equations reference themselves in some way. So it looks it's base value, then looks at the coordinates, makes a change, then again at how that changes the base value. This repeats for a defined number of steps..What's really cool is that you don't have to make the space complete discrete; that is, you can always zoom in and find higher precision coordinates and therefore generate more colours..This doesn't just apply to functions, one example I like to show is a chaotic double pendulum; http://en.wikipedia.org/wiki/Double_pendulum.Scroll down on that site, and look at the green/red fractal. That maps how many flips the pendulum does based it's and the other's starting angles. It's hard to summarise here, and is in fact all explain on the wiki..Hope that helps",
    "if you like fractals come check out /r/fractalporn!",
    "There's a lot of definitions here that are pretty good but miss the real, key defining feature..A fractal is a set of points (for example, a shape) where a piece of that set looks like the whole thing. This is a property known as self-similarity. .The simplest and most boring example of a self-similar set is a line segment. If you look at a piece of a line segment, that's another line segment. It looks just the same as the original only smaller. .Now, like I said, that's the most boring example, and it's usually not considered a fractal because it's too boring (mathematicians have a more precise way of saying this, but it would take a while to explain). A much more interesting, but still very simple, example is the Cantor set. This is the simplest thing that can properly be called a fractal. .You draw a Cantor set like this: take a line segment and erase the middle third. Now of those two thirds remaining, erase the middle thirds of each. Next, erase the middle thirds of those four segments. Keep doing this forever. (There's a picture of the first six steps in that Wikipedia article I linked. Don't worry too much about the math surrounding it, the picture is the important part.).Now here we can see the two important features that make it a fractal:..It's self-similar..It's very complex, and the complexity goes up as the detail with which we draw it goes up...These two points together mean a few things:..No fractal can truly be drawn because it takes an infinite number of steps to draw it. So any picture you ever see of a fractal is actually just an approximation..No matter how small of a piece you take of a fractal, you'll always find a piece of that which looks like the whole thing...Fractals are interesting for a few reasons:..They're weird. Some of them are great examples of sets that have surprising and unusual properties. For example, the area inside of a Koch snowflake is finite, but the perimeter is infinite..Complex, fractal-like patterns show up in nature a lot. For example, ferns, mountains, lightning bolts, and coastlines all have fractal-like properties..They can be very pretty.",
    "Very nice explanation. One should look into a cantor set and cantor dust to see where it's going and read upon coastlines, and problematics behind it. That pretty much sums up fractals 101.",
    "Basically a repetitive building instruction. .for instance: Take a cube. .Put a smaller cube on the free side of every cube you have..repeat..result: link",
    "In truth, 5 yr old, fractals are not just 'one thing', but a set of related concepts and ideas that generally have to do with understanding the relationships between different scales. By scales I mean how much you zoom in or out, like a microscope that can change its magnification. .One aspect of fractally-structured objects, which I don't think has been mentioned here, is that normal tools we use to understand groups of things can't be properly applied to them. For example, an average (mean) is not a sensible measure of a fractal object. Consider the branches of a tree. A tree is a natural fractal structure. There is 1 huge 'branch' (the trunk) and off of that shoot a couple of smaller branches, and off of them even smaller branches, and off of them even smaller branches, etc etc. The consequence of this is that there are MANY MANY tiny branches, but only a couple really big ones. .If you tried to take the average of the cirmcumference of the branches, you would find it does not converge to a single number. That is, as you measure more and more branches, the 'average' keeps changing. 'Average' is not a good measure for a fractal object..Instead, you need to plot the distribution of branch sizes on a logxlog plot (you're a smart 5 yr old, right?). A fractal object will form a straight line (with some slope) on this plot. The slope of the line can tell you more about the distribution of branch size than can an 'average' (which assumes a bell curve distribution). .Hope this helps, son.",
    "A fractal is a mathematically defined shape that has just as much detail at any scale. .Compare this to a normal photograph:  if you take a photo that is 1 foot across, cut it in fourths, and blow up one of those pieces until it is the same size as the original, it gets a bit fuzzier.  If you keep repeating that process, it gets super fuzzy real fast and there are no details left..If you do that with a fractal, there will always be as many details in the picture as what you started out with, even though what you end up with might not look at all like what you started with.  You can cut the picture up and enlarge a piece of it, repeat that hundreds of times, and there's still tiny, tantalizing details in every little bit.",
    "(I think my Friend Donald Duck does it best)[http://www.youtube.com/watch?v=YRD4gb0p5RM]",
    "Haha!  This looks awesome, I love Donald!.Will so have to watch the whole vid very soon!!.Thanks for the link. =)",
    "Fractals are basically things that look the same no matter how closely you look at them...I like to think of them as visual infinity.",
    "[deleted]",
    "i disagree with your disagreement, and apparently wikipedia does as well.....A fractal is a mathematical set that has a fractal dimension that usually exceeds its topological dimension and may fall between the integers. Fractals are typically self-similar patterns, where self-similar means they are \"the same from near as from far\". Fractals may be exactly the same at every scale, or as illustrated in Figure 1, they may be nearly the same at different scales. The definition of fractal goes beyond self-similarity per se to exclude trivial self-similarity and include the idea of a detailed pattern repeating itself.",
    "A fractal is any equation or pattern, that when seen as an image, produces a picture, which can be zoomed into infinity and will still produce the same picture. The word fractal was made by Benoît Mandelbrot in 1975 from the Latin word fractus, which means \"broken\" or \"fractured\". A simple example is a tree that branches infinitely into smaller branches, and those branches into smaller branches and so on.",
    "Perhaps this book is above a 5 year old reading level, but \"Chaos\" is a phenomenal book written in layman's terms about chaos theory, fractals, etc... .I read it a few years back and it explained everything very clearly and was very easy to follow..http://www.amazon.com/Chaos-Making-Science-James-Gleick/dp/0143113453/ref=sr_1_1?s=books&ie=UTF8&qid=1346333614&sr=1-1&keywords=chaos",
    "The point of a fractal is that if you zoom in on it, the small part you're focusing on will look like it's made up of tiny copies of the whole thing.  And when you zoom in on the tiny copies, they're made up of small parts that are also tiny copies of the whole thing.  In a perfect fractal, you can keep zooming in and finding more copies of the whole thing forever..Fractals are cool because they can be made by very simple rules (\"when you see this, replace it with a copy of the fractal's pattern\"), but the shapes they produce can be infinitely complex.  This lets us describe very complicated things in a very short, simple way; which is good for making files small and efficient.  They also show up in nature a lot, probably because they are so easy to build..Example fractal:.Draw a line.  At the end of the line, split it into two so it looks like a Y.  You now have one large Y..The end of the Y is made up of two lines, each like the first one.  At the end of each, branch them into two so they both look like Y's too.  You now have a large Y, with Y's at the ends..You can keep doing this until you run out of space on the paper.  It ends up looking like a tree, or a piece of broccoli, or ..well.. a Fractal.",
    "The best description of fractals I ever heard was on Stuff You Should Know. Those guys are great, really explain difficult concepts well and humorously. .Here's a link to that particular episode.",
    "Actually Khan Academy does a marvelous job explaining it",
    "http://www.youtube.com/watch?v=ES-yKOYaXq0 .This could help. Fun fact! You remember when cell phones had stupid antennas? Well the reason those went away was because someone figured out if you make an antenna out of a fractal it could be put inside the phone!",
    "This is the first thing I though of!  Actually, it taught me what a fractals was really well!.EDIT: But now the lyrics need to change!  Mandelbrot is in Heaven now =P",
    "5 minute video of a  Mandelbrot set zoom!.http://www.youtube.com/watch?v=0jGaio87u3A",
    "A fractal is something with a fractional dimension.  It's not 1-dimentional or 2-dimentional, but maybe 1.26-dimensional..How the heck does that work?  Well, I might have to explain it a little bit above the 5-year-old level.  But not too far..If you have a 1-dimentional line, and magnify it by a factor of 2, it gets twice as big.  More generally, if you magnify it by a factor of k, it gets k1 times as big..Now, if you have a 2-dimentional object like a square, and you magnify it by a factor of 2, it's 4 times as big.  Twice as tall and twice as wide; you can fit four of the original squares inside the magnified square.  More generally, if you magnify it by a factor of k, it gets k2 times as big..A three-dimensional object like a box, if you magnify by a factor of k, gets k3 times as big.  You can fit 23 = 8 small boxes inside a double-dimensioned box..Now let's consider the famous Koch snowflake.  Each line of  it consists of four copies, each 1/3 the size.  Turned around, it takes four copies to make one three times as big.  3x = 4.  It turns out that x = log(4)/log(3) = 1.2618595....Or, to take another simple example, the (standard ternary) Cantor dust.  Each piece consists of two copies of itself, each 1/3 the size.  Its dimension is log(2)/log(3) =  0.63092975..To draw a figure with dimension between 1 and 2, you need to use a 2-dmensional drawing surface, but the fractal doesn't use all of it..It turns out that fractal objects are amazingly intricate and fascinating, and have a lot f nifty properties.  But the origin of the term is \"fractional dimensions\"..A third example: the Menger sponge.  It's made up of 20 copies of itself, each 1/3 the size.  Its dimension is log(20)/log(3) = 2.726833...  A solid cube is made up of 27 copies of itself each 1/3 the size, so a solid cube is of dimension log(27)/log(3) = 3.",
    "A fractal is a set whose Haussdorf dimension is not a whole number. That being said, if your set can be obtain with an inductive sequence, then your fractal will be what we call auto similar..http://en.m.wikipedia.org/wiki/Hausdorff_dimension.Man we can't explain it like you're five, this is a very hard notion. And a lot of bullshit is said about it.",
    "It's easy to explain like you're five, because everybody intuitively knows it, you just need to look at it differently. I'd say \"a fractal is a fern's leaf\" is probably the simplest explanation.",
    "Except that it is not.",
    "[deleted]",
    "This is the worst excuse I have seen for hating math.  Have an upvote anyway.",
    "[deleted]",
    "What I'm still missing from the discussion is the explanation about dimensions. Dimensions can be for instance, height, width and length. You know how things can have either one dimension (a line), or two (a square or a circle) or three (a cube, or a tree). Fractals are defined by having an amount of dimensions that is not a whole number. You can for instance have a fractal with a dimension of 1.7 or 2.3 (Hence the word fractal, it refers to the fractal dimensionality of the structure) This results in figures with all kinds of weird properties, such as being able to have a boundary of infinite length, but still a surface area that is under a specific limit. These properties are actually useful as well, for instance in your cellphone, where an approximation of a fractal means they've been able to put a lot of surface in a small area of antenna, which is why we don't need to pull out our cell-phone antennae anymore when we make a phone call.",
    "newton fractals are pretty easy to make, you should give it a try if you have any experience w/ matlab. apply newton's root finding method to an equation and assign different color values for the roots, then plot.  google to find appropriate equations if you can't come up w any.",
    "Think of a leaf made up of smaller leaves which are made up of even smaller leaves. And it's pretty.",
    "Squiggly shapes!",
    "Infinitely repeating self similar forms. Thats all there is to it!",
    "This might help. http://www.howstuffworks.com/fractals.htm",
    "Would a honeycomb be considered a fractal?",
    "If the initial shape is one cone, and inside it is all the smaller cones, and then you keep the pattern going inside each of those combs indefinitely, then it would be a fractal.",
    "They are NOT shards of the Infinity Sword.",
    "PBS Nova is my jam! .(the whole program is worth watching, but the first 2 minutes is basically the TL;DR.)",
    "Think about how broccoli looks. Imagine you take one limb of that broccoli and look at it. It will look the same as the big piece, only smaller. If you take a piece of that chunk the same will happen and so on. These levels are called iterations and they will keep happening until the bit of broccoli is too small to see..Here's an image showing a fractal done with equilateral triangles. You see how each iteration gets more complicated?.The first is one triangle, then the triangle has another inside of it, then each triangle has a triangle inside of them, then every one of those triangles has one inside of them..When I took Geometry, fractals weren't focused on. I don't think they were even on the final. They were just a quick side lesson and extra credit. Plus, they're a good way to impress a teacher. I hope this has been helpful and accurate.",
    "(Disclaimer: This is more like an ELI10 explanation).The fundamental defining property of fractals is self-similarity - each \"layer\" is the same as the one \"above\" it. This gives them two very unique properties:..A very simple and compact description/rule to generate them..A lot of complexity in the overall pattern..As an example, start by drawing a triangle and color it in with black. Then keep doing the following until you get really really bored or cannot see any more black.- Each time you see a colored triangle-looking area, erase out a smaller triangle inside it so that the erased triangle is inverted. Kind of like this..This is a fractal. The rule to generate it is very simple but the resulting pattern is \"infinitely complex\", in some sense.",
    "They're typically the best way to spot psychic paper.",
    "My old math teacher said fractals were in everything if I remember correctly. It makes sense when you consider it. You can see it in landmasses as patterns of growth or change. Tectonic shifts, volcanic activity, gravity. I think once you start to measure more things - anything at all from erosion effects to coastlines to mountain elevations - you can extrapolate, like, data and shit. You make graphs and spot patterns..I probably don't do the subject any justice since it's been a while since my last math class. I just know you can spot fractals in nature, and that makes sense given how unique and complex Earth is (at least for us, not knowing of any other nearby planet like it).",
    "watch this documentary, it will blow your mind.http://www.youtube.com/watch?v=LemPnZn54Kw",
    "I think the coolest thing about fractals is not geometric, tangible fractals but fractal concepts. like the fact that an ecosystem is made up of populations of different species, each acting much like the organs within their own bodies do, or the cells within those organs. Or look at the way people organize themselves in governments and coroprations, etc. like a tree",
    "Hey, not a full explanation, but this is a documentary about fractals. This link goes directly to the part where they explain what a fractal is."
  ]
}