{
  "https://old.reddit.com/r/Futurology/comments/mb510d/national_renewable_energy_laboratory_solar_panel/": [
    "They use III-V materials, which are so expensive they're only used on satellites. In order to offset this price by using less material you have to concentrate the light. They used 143 sun concentration. I don't foresee roofs being a place for this kind of tech.",
    "Roof's wont be used for this type of tech, this type of tech will be sewed into bagging, clothing and sit nicely outside the home inconspicuous as it renders the need for a solar roof obsolete as stated in the headline..To make your assertion, you completely ignored efficiency gains with one sun illumination to make this point - meaning you completely ignored key information from the article presented..https://www.nrel.gov/news/press/2020/nrel-six-junction-solar-cell-sets-two-world-records-for-efficiency.html.Per the article from the National Renewable Energy Laboratories own website, and as quoted correctly in the headline-..A variation of the same cell also set the efficiency record under one-sun illumination at 39.3%.",
    "But without concentration, you need more area, which means you're back to square one with very expensive materials. That was my point. This might be interesting for industrial applications, but not consumer products.",
    "No this is a Six Junction Solar Panel that can and will deliver 39.3% efficiency under standard Sun Light conditions. It is molecularly replete at 45,000 atoms in thickness..No matter how you attempt to diminish this technology, the truth is One Sun Illumination is still the standard measurement of one day of high sunlight in favorable conditions..Being that it utilizes 140 photovoltaic materials which are already fabricated at the molecular level, all one need do is apply ML to effectively reconfigure this technology with superior molecular efficiency with more overlapping layers..I say again - No matter how you try to angle this, attempting to utilize sun concentration levels to dissociate readers with the fact that 1 sun illumination in measurement is equal to 1 standard day of favorable high sunlight conditions is an unreasonable attempt at diminishing and indeed an attempt to tarnish the validity of this article and will not diminish this breakthroughs success..https://en.wikipedia.org/wiki/Solar_simulator.\"1 sun is typically defined as the nominal full sunlight intensity on a bright clear day on Earth, which measures 1000 W/m2.\".You may continue on by claiming neither of you are attempting to diminish the legitimacy of this article, and then proceed to offer au metrics or some other dissociative value meant to confuse the reader (perhaps by pointing out the article lists mirrors are in use as multipliers - a concentration tool - which in fact will also be used in standard daylight testbeds).I assume another attempt at dissuading the reader by bringing into question the relative metrics of One Sun Illumination may be made, with a quick change of subject matter to further distress those curating this debate..I assure you all further attempts to discredit what is essentially already advanced material nanotechnology at the molecular level will falter as the discerning reader is far more witful than some technology opposing misanthropes..You are making dissociative claims at the expense of the reader based on at best, one factor - a concentration mechanism - a mirror - or particularly in the case of industrial space applications - a parabolic reflector - both of which can already be applied to concentrate sunlight - but are particularly moot when far better molecular/nanorobotic solutions are currently being fabricated to work in unison layered with the technology specified..And even with the transgression of indeed successfully applying the concentration mechanism to the solar panel itself - as listed above - mirrors will still typically be used in standard daylight in consortium with solar panels because they are a low cost value solution..And since computer science specifically states - by 2023 all molecular materials will be at cost effective margins - the cost debate is relegated to at most a 15 year time frame in totality. With most costly molecular materials becoming consumer friendly within a 5 year time frame due to advances in molecular fabrication and falling prices of material robotics technologies..A welcomed side effect of the ML bolstered Robotics Industrial Revolution we recently entered..To dissociate the prospective reader over the validity of the article, based on tangible Parabolic Reflectors - particularly when this was not used the aforementioned - and specifically when it comes from a government backed entity such as https://www.nrel.gov is quiet disingenuous.",
    "But residential PV is already 25% efficient. 40% is great but I don't see how one panel will replace an array, unless your array was less than 2 panels.",
    "Answer, standard solar panel thickness is over 1.3 inches in thickness - this solar solution as I have stated will undergo massive efficiency gains as this technology is layered atop itself through superior molecular manufacturing. Any cost material concerns should read my previous statements in this thread.",
    "You can't layer the same panels on top of each other and expect incremental gains. Once a spectrum light has been absorbed, well it's absorbed. You can't stack 5 panels on top of each other and expect 200% light conversion..Candidly your language and attitude has you sounding like a shill for the product.",
    "Wrong, and blatantly so - this technology is at nascent levels of production and designed to be scaled up - to assume it will remain at a paltry 39.3% efficiency while at less than the thickness of a strand of hair ignores exponential gains when conceptual technologies are scaled up at magnitude. You can indeed layer this technology utilizing molecular fabrication with ML enforced advancements - to cite otherwise is scientifically preposterous and a rather dubious claim.",
    "It's not, it's physics. You're literally just spewing generic buzzwords and using it as logic..You state several places in your past posts that you are a \"computer scientist\". Perhaps they didn't teach this in your books?",
    "Again, to state you can't layer a panel atop another panel and expect gains is preposterous - and then to bring up physics as the basis at which these improvement's are rendered invalid states you obviously ignored the article in question already layers 6 different solar panel technologies atop one another and indeed 140 different materials..So in fact you will see not incremental gains but exponential gains when these panels are successfully 'layered' atop one another using ML infused molecular nanorobotics and other cohesive technologies to simply increase efficiency..To continue making your extremely flawed arguments based on physics one would have to continue to ignore such breakthroughs which are numerous. Physics states, very plainly this technology is impossible to fabricate with such nuanced precision - stacked materials atop one another to absorb more sunlight - impossible based on simple physics - though this is precisely the hurdle overcome and described by the article...  yet here we are and here you are continuing a worthless pursuit to diminish the validity of such advancements..Physics also states very plainly - many technologies such as FTL travel - impossible yet here we are again with a legitimate proposal to build the warp drive which only need propel a vehicle at 25% the speed of light to be considered FTL travel..Physics also state Quantum Teleportation is impossible to harness yet... .https://www.scientificamerican.com/article/qutrit-experiments-are-a-first-in-quantum-teleportation/.Material physics always has something to state when someone claims a breakthrough is impossible due to physics. .Molecular robotics technologies will completely circumvent and eliminate all physics based quandaries and that is the era we are entering due to the Molecular Nanorobotics Industrial Revolution. Scheduled to completely catalyze by no later than 2023. .The article itself dismantles your claim, if one would only read it - and then to latch onto physics as if molecular nano robotics is not here to work cohesively with this technology says you simply don't want to believe these cohesive technologies are ready - which would explain your decades old reliance on outdated information - as if you quit studying the progress of technology last century..Again, molecular nanorobotics is here in lock step in conjunction with this cohesive technology mentioned in the threads title https://www.zmescience.com/science/nanobots-coordinating-in-vivo-82637465/.Atom scaled robot's autonomously working in unison - and the above example citing molecular level robotics at no more than 90 atoms in totality within a living host. .And numerous accounts and citations of other molecular technologies prove your understanding and reliance on physics to attempt to dismantle said facts are fundamentally flawed.",
    "Dude I can't tell if you're trolling or if this has been brought up already but there's only so much solar energy that hits a given area on earth, e.g. a residential roof. Assuming we're limited to <100% efficient solar cells, there's not room for orders of magnitude improvement in photovoltaic efficiency. Modern PV modules are already north of 20% efficient. I think that's what your discussion buds were getting at. Cheers",
    "I'm starting to think this is a bot. The replies are very similar and don't actually answer anything. It then always goes back to \"molecular nanorobotics\" as a reply even when it's irrelevant. Anyway to check whether or not this is a bot? If so, it's really good.",
    "Yes and of that 13% of sunlight that perforates any given area current solar voltaic at 25% efficiency these panels only in fact utilizes .93% of these emissions. So at 25% efficiency we still aren't anywhere close to utilizing the entire 13% of sunlight that saturates a given area..One would only effectively need increase this standard to a mere 3% absorption utilizing the autonomous molecular nanorobotics revolution such as I have stated in this thread numerous times to see gains of 10,000% and above due to increases in solar panel efficiency when paired with molecular nanorobotics that help utilize and absorb a higher percentage of the suns emission across a given area..https://www.zmescience.com/science/nanobots-coordinating-in-vivo-82637465/.To continually insinuate this is improbable is to flatly ignore the existence of such technologies that will work in uniform cohesively with solar technologies as specified.",
    "TLDR: \"Let me finish drinking my ten cups of coffee and reply....\"",
    "No he's right.  I worked on concentrated solar, it's not cost-competitive with conventional solar, even with 20% efficiency.  It's not leaving the lab unless it's cheaper per-watt and it has a long way to go to even catch up (and it won't)",
    "As once scaled up, one panel should easily outperform an entire solar roof array...Immediate next comment..Roof's wont be used for this type of tech",
    "You seam like you understand this its 4x the efficiency of current panels. A normal us house needs like 10 320W panels you would still need the are of about 2,5 of those. As operating eficiency is close to 12% on most panels. On residential zones the roofs would still be prefered as its \"dead area\" in commercial use it migth be ok. And we will see in the future as all of this is very last edge and have a lot to be figured out before production.",
    "None of this is \"Far out There\" we are fast entering the Molecular Nanorobotics Industrial Revolution - which computer science states as fact - will be in full swing by 2023. .Which is precisely why Fully Autonomous Molecular Nano Robotics observed for the first time within a living host - such as this example are beginning to make headlines..https://www.zmescience.com/science/nanobots-coordinating-in-vivo-82637465/",
    "I work at NREL, and it is not quite as simple as it sounds. III-V's are expensive and difficult to manufacture. They also use some pretty nasty precursors. We have been producing cells in the 35+% range for over a decade. When you join them together, encapsulate etc. you lose efficiency. We work on all of these challenges, but your not likely to see III-V's all over roof tops any time soon. They are more in the realm of spacecraft. .Check out perovskite's. Not anywhere near as efficient, but insanely cheap to make. Few more years down the line and you might see those on all sorts of products.",
    "That is only if you ignore cohesive technologies sir, example - https://www.zmescience.com/science/nanobots-coordinating-in-vivo-82637465/ .Molecular nanorobotics, which computer science states along with your precursor molecular fabrication technologies - will enable this technology and make it a quick reality - if in fact something far superior is not achieved by pure use of molecular nanorobotics alone. .And to ignore this is to ignore Computer Science at the expense of nuanced facts you and everyone else attempting to diminish the law of accelerating returns are very apt to ignore for these arguments.",
    "If a single one of these fancy panels could generate as much power as an entire roof array, then putting solar on top of EVs suddenly would become practical. You would never need to plug in with that.",
    "Does it matter though? Solar panels are placed on land that has no other use - roofs, deserts, wasteland etc. The cost of the panels is the important factor. Would these ones be less than twice as expensive as current panels?",
    "Great question... it does matter!.You're right, they (usually) aren't competing for the space so cost is a bigger driver than size. However, most of the total installed costs are fixed - engineering, labor, the structural support if necessary, etc. So when the efficiency goes up dramatically, output for all those fixed costs goes up dramatically too. Even if the panels double in cost, that's still less than half of the total installed cost of the finished assembly..So ultimately, the cost of the panel itself can't be looked at in isolation and tech like this has a lot of potential when it does finally mature into the market. Also, we're starting to see on-site renewables become important enough (changing codes, ESG investment, social pressure, etc.) that having a smaller, more capable panels open up additional possibilities even with a higher cost. It's not always the cheapest solution that wins on projects that really demand it..Check out page 8 here for data up to 2018 demonstrating this (and it's only gotten better since): https://www.nrel.gov/docs/fy19osti/72399.pdf.Source: I work in the field of sustainable commercial building design.",
    "Does it matter? Tesla, the leading manufacturer in solar roof tiles - has an efficiency of 22% per tile..These tiles, should in fact cost way more in their current state - but prices should fall dramatically due to large strides in molecular fabrication..These panels in their preliminary state - are 45 thousands atoms in thickness, less thickness than a human hair - meaning currently they are in nascent form ready to be scaled up..Once these panels reach a standard thickness efficiency gains will increase at exponential levels.  Suddenly 39% efficiency reaches the magic 'Plug-and-Play' without need for battery level of efficiency with a projected 650% efficiency rate. While the most modern Molecular Fabrication methods are projected to in totality boost solar efficiencies far beyond 10,000% above current state of the art solar technologies within 1-2 decades..These next gen panels wont be sitting on roofs, they will be sewn into clothing materials, baggage, woven into electronics - and will offer near limitless energy for people on the go - or for those at home who decide to place a solar panel out in the yard..As with all preliminary technologies - the LCD a good example - which was unveiled at magnitude (margins ready for production) with a cost of over 130k, 10 years later that cost fell dramatically and the technology increased exponentially - such is standard with all technology when produced at magnitude - expect prices to fall dramatically for this technology which is completely reliant on molecular/nano fabrication - particularly as molecular fabrication methods have become cheap and reliable enough to enter the home sector..Molecular Level 3d Printer Utilizing Laser Grade Fabrication for Home Electronics Fabrication",
    "There is currently no such thing as molecular fabrication, and there won't be in this decade at least. Also, you can't have 10,000% above an efficiency of 22%. An increase of 345% gets you to 100%, which is of course impossible (because thermodynamics). And all materials will have some heat loss and reflection, so getting above 50% would be superb. Perhaps science ain't your forte?",
    "I believe they may be referring to molecular beam epitaxy as molecular fabrication? These methods do exist currently. .10,000% efficiency is incredibly ridiculous... though two electron-one photon transitions have been observed (in the xray region at least). Energy is conserved of course, but efficiency on a photon basis is over unity for these transitions. So \"200%\", just shy of 10,000%, if this phenomenon can ever be engineered to work across the visible/IR portion of the spectrum.",
    "Really looking forward to these over unity solar panels. If there's no sun, I can just power it with a torch.",
    "It's a very cool piece of work, but it's highly doubtful these cells can compete with traditional PV on a Wh/$ basis, which is the important metric for mass power generation. The important thing is that we do have enough space to cover with solar cells, if we want to. So making them super small is not, at this point, the important metric. Still, in the long run it would obviously be advantageous to have smaller cells that do more, if they can work out how to make them cheaply.",
    "Aluminum was once as precious as gold. Just because a material is expensive now doesn't mean it will always be so.",
    "The good thing about future technologies is that individually, none of us will determine future use. One could say, \"This solar panel is the best.\" or \"The nuclear power plant is the best.\" But then you have hordes of scientists and investors that collectively determine uptake. So arguing about this sort of stuff is useless.",
    "Nice tech but i like the tech done back around 2003 by Quebec scientists. They were able to harness the radiation around us for energy. so cars,devices,appliances homes etc all powered by the radiation around us is the holy grail for energy. energy 24/7 .",
    "Link to that?.Also, if that was nearly 20 years ago why has there been no advancement or word on it?",
    "someone is keeping it a secret."
  ]
}